/* Generated localization file */

"\n\n请重新打开终端，或执行 `source ~/.zshrc`，让 launcher 生效。" = "\n\n请重新打开终端，或执行 `source ~/.zshrc`，让 launcher 生效。";
"\n                1. 画布点 LCD 屏幕 → Inspector 显示「修改」\n                2. 点「修改」进入编辑态（接管 BLE）\n                3. 选择你的图片（动图推荐 ≤200 帧、≤2MB），可先在虚拟屏幕里预览\n                4. 确认后点底部「写入键盘」统一写入设备\n                " = "\n                1. 画布点 LCD 屏幕 → Inspector 显示「修改」\n                2. 点「修改」进入编辑态（接管 BLE）\n                3. 选择你的图片（动图推荐 ≤200 帧、≤2MB），可先在虚拟屏幕里预览\n                4. 确认后点底部「写入键盘」统一写入设备\n                ";
"\n                Mode 1 → claude_0.gif（出厂内置）\n                Mode 2 → cursor.gif\n                Mode 3 → codex.gif\n                Mode 4 → 预留/自定义\n\n                首次连接键盘且发现某个 Mode 的 flash slot 为空时，主 App 会自动把对应 bundle 图片推到键盘上。\n                " = "\n                Mode 1 → claude_0.gif（出厂内置）\n                Mode 2 → cursor.gif\n                Mode 3 → codex.gif\n                Mode 4 → 预留/自定义\n\n                首次连接键盘且发现某个 Mode 的 flash slot 为空时，主 App 会自动把对应 bundle 图片推到键盘上。\n                ";
"\n                • macOS 原生转写：在地化语言识别，识别完 ⌘V 写回光标。适合任何输入框\n                • Fn/Globe：用于 Typeless、微信语音、豆包输入法，在对应软件内把快捷键设为 Fn/Globe\n                • 自定义快捷键：只写入键盘，不接管为固定语音预设\n                • AhaType：先识别再优化提示词（需登录）\n                " = "\n                • macOS 原生转写：在地化语言识别，识别完 ⌘V 写回光标。适合任何输入框\n                • Fn/Globe：用于 Typeless、微信语音、豆包输入法，在对应软件内把快捷键设为 Fn/Globe\n                • 自定义快捷键：只写入键盘，不接管为固定语音预设\n                • AhaType：先识别再优化提示词（需登录）\n                ";
"\n                • 主 App（你正在用的）— 看配置、改键位、上传 LCD 图片、查诊断\n                • Agent 守护进程 — 后台常驻；监听 IDE 的 Hook（Claude / Cursor / Codex / Kimi），并在 BLE 上向键盘转发当前任务状态\n                • 键盘固件 — 收到 BLE 状态后驱动灯条颜色、LCD 显示、按键映射\n                " = "\n                • 主 App（你正在用的）— 看配置、改键位、上传 LCD 图片、查诊断\n                • Agent 守护进程 — 后台常驻；监听 IDE 的 Hook（Claude / Cursor / Codex / Kimi），并在 BLE 上向键盘转发当前任务状态\n                • 键盘固件 — 收到 BLE 状态后驱动灯条颜色、LCD 显示、按键映射\n                ";
"\n                • 检查右上角是否「已连接」\n                • 切到正在用的 Mode\n                • 触发一次工具调用让 Hook 真的发 0x90 给键盘\n                • 如果是手动批准档 + Mode 1：preToolUse 是蓝、其他状态是红\n                " = "\n                • 检查右上角是否「已连接」\n                • 切到正在用的 Mode\n                • 触发一次工具调用让 Hook 真的发 0x90 给键盘\n                • 如果是手动批准档 + Mode 1：preToolUse 是蓝、其他状态是红\n                ";
"\n                • 短按（Toggle）：第一次按开始，第二次按结束 — 适合长段话\n                • 长按（Hold-to-speak）：按住时录音，松开停 — 适合微信、豆包等需要\"按住\"的输入法\n\n                两种模式在 Key 1 Inspector 的「触发方式」Tab 里切换。\n                " = "\n                • 短按（Toggle）：第一次按开始，第二次按结束 — 适合长段话\n                • 长按（Hold-to-speak）：按住时录音，松开停 — 适合微信、豆包等需要\"按住\"的输入法\n\n                两种模式在 Key 1 Inspector 的「触发方式」Tab 里切换。\n                ";
"\n                • 绿色「✓ 已上传 N 帧」：键盘 flash 真有 N 帧（你或自动同步推的）\n                • 灰色「未上传」：键盘 flash 空，正显示固件默认或留空\n                • 没有徽章：还没自占 BLE 查到（点过一次「修改」就有了）\n                " = "\n                • 绿色「✓ 已上传 N 帧」：键盘 flash 真有 N 帧（你或自动同步推的）\n                • 灰色「未上传」：键盘 flash 空，正显示固件默认或留空\n                • 没有徽章：还没自占 BLE 查到（点过一次「修改」就有了）\n                ";
"\n                • 自动批准（switchState=0）：Hook 拦截每次工具调用 / 命令请求时直接放行\n                • 手动批准（switchState=1）：Hook 把决定交回终端，由你手动按 Key2/Key3 通过或拒绝\n                " = "\n                • 自动批准（switchState=0）：Hook 拦截每次工具调用 / 命令请求时直接放行\n                • 手动批准（switchState=1）：Hook 把决定交回终端，由你手动按 Key2/Key3 通过或拒绝\n                ";
"\n                • 蓝牙：连接键盘必须\n                • 麦克风：苹果原生转写、AhaType、按住说话所有语音功能都需要\n                • 输入监控：捕获语音键的按下/松开事件\n                • 辅助功能：模拟键盘按键（用于 ⌘V 写回文本、注入 Fn/Globe 等）\n                • 语音识别：苹果原生转写\n                • Siri 与听写（macOS 13+）：原生转写依赖项\n                " = "\n                • 蓝牙：连接键盘必须\n                • 麦克风：苹果原生转写、AhaType、按住说话所有语音功能都需要\n                • 输入监控：捕获语音键的按下/松开事件\n                • 辅助功能：模拟键盘按键（用于 ⌘V 写回文本、注入 Fn/Globe 等）\n                • 语音识别：苹果原生转写\n                • Siri 与听写（macOS 13+）：原生转写依赖项\n                ";
"\n                同一时刻只有一个进程能持有键盘的 BLE 连接：\n                • 默认 Agent 占用 → Hook 状态实时上键盘、自动批准链可用\n                • 你在画布点「修改」时 → 主 App 临时接管，能上传 LCD 图片、改键位、读图片元信息\n                • 点「返回」 → 主 App 释放，Agent 自动接回\n                " = "\n                同一时刻只有一个进程能持有键盘的 BLE 连接：\n                • 默认 Agent 占用 → Hook 状态实时上键盘、自动批准链可用\n                • 你在画布点「修改」时 → 主 App 临时接管，能上传 LCD 图片、改键位、读图片元信息\n                • 点「返回」 → 主 App 释放，Agent 自动接回\n                ";
"\n                当拨杆 = auto (switchState=0) 时，固件把部分 state 强制改成彩虹效果：\n                • PreToolUse / PermissionRequest → 整条彩虹波浪\n                • PostToolUse / UserPromptSubmit → 单点彩虹流水\n                这就是你看到「Cursor 一跑灯条变彩虹」的原因——是 auto 档的视觉提示，不是 Cursor 专属。\n                " = "\n                当拨杆 = auto (switchState=0) 时，固件把部分 state 强制改成彩虹效果：\n                • PreToolUse / PermissionRequest → 整条彩虹波浪\n                • PostToolUse / UserPromptSubmit → 单点彩虹流水\n                这就是你看到「Cursor 一跑灯条变彩虹」的原因——是 auto 档的视觉提示，不是 Cursor 专属。\n                ";
"\n                打开「权限诊断」可以看到 Agent 自检结果：\n                • LaunchAgent 已注册：login item 装好\n                • 进程在跑：launchd 拉起了 ahakeyconfig-agent\n                • Hook 已配置：Claude/Cursor/Codex/Kimi 的 .json / settings 都加好了 ahakey-hook 引用\n                " = "\n                打开「权限诊断」可以看到 Agent 自检结果：\n                • LaunchAgent 已注册：login item 装好\n                • 进程在跑：launchd 拉起了 ahakeyconfig-agent\n                • Hook 已配置：Claude/Cursor/Codex/Kimi 的 .json / settings 都加好了 ahakey-hook 引用\n                ";
"\n                按这顺序排查：\n                1. Agent 在跑吗？打开「权限诊断」看\n                2. Agent 是否占着蓝牙？画布顶部应显示已连接，且不在编辑态\n                3. 拨杆在 auto 档？看顶部状态栏；不是的话点画布拨杆切到 auto\n                4. IDE 的 Hook 文件配了吗？「权限诊断」会列出 Claude/Cursor/Codex/Kimi 各自的 Hook 安装状态\n                5. 装完后是否重启过 IDE？尤其 Kimi 安装/升级后必须完全关闭再重开\n                " = "\n                按这顺序排查：\n                1. Agent 在跑吗？打开「权限诊断」看\n                2. Agent 是否占着蓝牙？画布顶部应显示已连接，且不在编辑态\n                3. 拨杆在 auto 档？看顶部状态栏；不是的话点画布拨杆切到 auto\n                4. IDE 的 Hook 文件配了吗？「权限诊断」会列出 Claude/Cursor/Codex/Kimi 各自的 Hook 安装状态\n                5. 装完后是否重启过 IDE？尤其 Kimi 安装/升级后必须完全关闭再重开\n                ";
"\n                最新固件中 0x91 已用于灯效预览。虚拟拨杆只作为 Hook 软件覆盖，不再写入键盘 sw_state。\n                " = "\n                最新固件中 0x91 已用于灯效预览。虚拟拨杆只作为 Hook 软件覆盖，不再写入键盘 sw_state。\n                ";
"\n                点完元件 → Inspector 显示「修改」按钮。点「修改」会接管 BLE 进入编辑态；改完点「写入键盘」写入配置，点「返回」退出编辑。\n                " = "\n                点完元件 → Inspector 显示「修改」按钮。点「修改」会接管 BLE 进入编辑态；改完点「写入键盘」写入配置，点「返回」退出编辑。\n                ";
"\n                自动同步只在主 App 自占 BLE 时才查图片元信息。流程：\n                1. 至少点一次「修改」让主 App 接管 BLE\n                2. 四个 Mode 的 0x83 查询完成后才会触发\n                3. 只对 flash 为空（picLength=0）的 Mode 生效\n                4. 如果你曾经手动改过 Inspector 里的「上传图片」路径，自动同步会跳过那个 Mode（不覆盖你的选择）\n                " = "\n                自动同步只在主 App 自占 BLE 时才查图片元信息。流程：\n                1. 至少点一次「修改」让主 App 接管 BLE\n                2. 四个 Mode 的 0x83 查询完成后才会触发\n                3. 只对 flash 为空（picLength=0）的 Mode 生效\n                4. 如果你曾经手动改过 Inspector 里的「上传图片」路径，自动同步会跳过那个 Mode（不覆盖你的选择）\n                ";
"\n                规划中，下一版本会做。当前所有固件升级都需要 USB-ISP（拆机短 BOOT + wchisp）。详细方案在仓库 docs 里。\n                " = "\n                规划中，下一版本会做。当前所有固件升级都需要 USB-ISP（拆机短 BOOT + wchisp）。详细方案在仓库 docs 里。\n                ";
"\n            Kimi Hooks 已写入 ~/.kimi/config.toml。\n\n            **AhaKey 拨杆接管也已部署**：\n            - 配置层：`~/.kimi-code/config.toml` 的 `default_permission_mode` 会随拨杆同步，决定**新启动**的 Kimi 会话默认权限。\n            - Launcher 层：`~/.ahakey/bin/kimi` 会在新会话启动时根据拨杆自动注入 `--yolo`（自动档）或不注入（手动档）。\n\n            如果 kimi 当前已经打开，请**完全关闭并重新打开一次**，新会话才会生效。正在运行的会话不受影响；如需实时切换当前会话，请手动输入 `/yolo on` 或 `/yolo off`。\n            以后若你**升级了 kimi-cli**，再次点击一次「安装 Kimi Hooks」即可把 launcher 补回去。\n\n            安装完成。Hooks 为 Beta，行为以官方文档为准。\n            " = "\n            Kimi Hooks 已写入 ~/.kimi/config.toml。\n\n            **AhaKey 拨杆接管也已部署**：\n            - 配置层：`~/.kimi-code/config.toml` 的 `default_permission_mode` 会随拨杆同步，决定**新启动**的 Kimi 会话默认权限。\n            - Launcher 层：`~/.ahakey/bin/kimi` 会在新会话启动时根据拨杆自动注入 `--yolo`（自动档）或不注入（手动档）。\n\n            如果 kimi 当前已经打开，请**完全关闭并重新打开一次**，新会话才会生效。正在运行的会话不受影响；如需实时切换当前会话，请手动输入 `/yolo on` 或 `/yolo off`。\n            以后若你**升级了 kimi-cli**，再次点击一次「安装 Kimi Hooks」即可把 launcher 补回去。\n\n            安装完成。Hooks 为 Beta，行为以官方文档为准。\n            ";
"\n请立即退出 AhaKey Studio 并重新启动，按系统提示重新勾选权限即可。" = "\n请立即退出 AhaKey Studio 并重新启动，按系统提示重新勾选权限即可。";
" IPS · 160×80 · RGB565 · 内置 16 Mbit Flash 存帧" = " IPS · 160×80 · RGB565 · 内置 16 Mbit Flash 存帧";
" IPS 显示；可上传图片（160×80, RGB565）。" = " IPS 显示；可上传图片（160×80, RGB565）。";
" · 有效期 %@" = " · 有效期 %@";
"%.2f 元" = "%.2f 元";
"%@ 图片预览" = "%@ 图片预览";
"%@ 已恢复默认值，等待同步。" = "%@ 已恢复默认值，等待同步。";
"%@ 激活失败: %@" = "%@ 激活失败: %@";
"%@ 默认动图自动同步失败: %@" = "%@ 默认动图自动同步失败: %@";
"%@ 默认图片自动同步失败: %@" = "%@ 默认图片自动同步失败: %@";
"%d FPS" = "%d FPS";
"%d dBm" = "%d dBm";
"%d 帧" = "%d 帧";
"%d 步 · %d / 98 字节" = "%d 步 · %d / 98 字节";
"%d%%" = "%d%%";
"%d/4 已授权" = "%d/4 已授权";
"%d分钟" = "%d分钟";
"%d小时" = "%d小时";
"%d小时%d分钟" = "%d小时%d分钟";
"%d（覆盖中）" = "%d（覆盖中）";
"(无日志)" = "(无日志)";
"))权限。请先在系统设置里打开后，再按一次语音键。" = "))权限。请先在系统设置里打开后，再按一次语音键。";
", response.cmd)) 成功" = ", response.cmd)) 成功";
"0 通知" = "0 通知";
"0.96\" IPS · 160×80 · RGB565 · 内置 16 Mbit Flash 存帧" = "0.96\" IPS · 160×80 · RGB565 · 内置 16 Mbit Flash 存帧";
"0.96\" IPS 显示；可上传图片（160×80, RGB565）。" = "0.96\" IPS 显示；可上传图片（160×80, RGB565）。";
"0x2050FF (蓝)" = "0x2050FF (蓝)";
"0xF02029 (红)" = "0xF02029 (红)";
"1 等待授权" = "1 等待授权";
"1. 点「现在申请权限」，按系统弹窗允许蓝牙、麦克风和语音转写。" = "1. 点「现在申请权限」，按系统弹窗允许蓝牙、麦克风和语音转写。";
"1. 点击虚拟键盘对应按键选中它。" = "1. 点击虚拟键盘对应按键选中它。";
"2 工具完毕" = "2 工具完毕";
"2. 自动打开系统设置后，依次开启 Siri、听写、辅助功能。" = "2. 自动打开系统设置后，依次开启 Siri、听写、辅助功能。";
"2. 语音键先选预设；其他键按需选单键或宏。" = "2. 语音键先选预设；其他键按需选单键或宏。";
"3 工具执行" = "3 工具执行";
"3 灯一组左右扫描。" = "3 灯一组左右扫描。";
"3. 最后开启输入监控；系统提示重启时退出并重新打开。" = "3. 最后开启输入监控；系统提示重启时退出并重新打开。";
"3. 配置完成后点「写入键盘」同步到键盘。" = "3. 配置完成后点「写入键盘」同步到键盘。";
"30 天" = "30 天";
"365 天" = "365 天";
"4 会话开始" = "4 会话开始";
"4. 切模式时 LCD 先显示描述，再回到该模式动图。" = "4. 切模式时 LCD 先显示描述，再回到该模式动图。";
"4. 切模式时 LCD 先显示描述，再回到该模式图片。" = "4. 切模式时 LCD 先显示描述，再回到该模式图片。";
"4. 回到这里点「我已完成，重新检查」继续体验输入。" = "4. 回到这里点「我已完成，重新检查」继续体验输入。";
"5 停止" = "5 停止";
"6 任务完成" = "6 任务完成";
"7 用户提交" = "7 用户提交";
"8 会话结束" = "8 会话结束";
"8 颗 WS2812B，颜色由固件 update_claude_ws2812() 决定，1:1 还原在画布上" = "8 颗 WS2812B，颜色由固件 update_claude_ws2812() 决定，1:1 还原在画布上";
"90 天" = "90 天";
"Agent 健康检查" = "Agent 健康检查";
"Agent 就绪时 Claude/Cursor/Codex 可随拨杆走批准。**Kimi**：安装过 AhaKey Kimi Hooks 后，拨杆会直接接管当前会话；若刚装完或刚升级 kimi-cli，重开一次 kimi 即可。" = "Agent 就绪时 Claude/Cursor/Codex 可随拨杆走批准。**Kimi**：安装过 AhaKey Kimi Hooks 后，拨杆会直接接管当前会话；若刚装完或刚升级 kimi-cli，重开一次 kimi 即可。";
"Agent 已安装，正在准备控制" = "Agent 已安装，正在准备控制";
"Agent 已运行。附注：launchctl 输出 — load：%@ start：%@" = "Agent 已运行。附注：launchctl 输出 — load：%@ start：%@";
"Agent 已连接蓝牙" = "Agent 已连接蓝牙";
"Agent 未安装" = "Agent 未安装";
"Agent 未运行" = "Agent 未运行";
"Agent 正在控制键盘" = "Agent 正在控制键盘";
"Agent 端覆盖" = "Agent 端覆盖";
"Agent 运行中（BLE 未连接）" = "Agent 运行中（BLE 未连接）";
"Agent 运行中，等待键盘连接" = "Agent 运行中，等待键盘连接";
"AhaKey Studio 使用 F19 作为 Fn 触发键，并在后台把语音键的按下/松开转换成 Fn/Globe，便于接入微信语音。" = "AhaKey Studio 使用 F19 作为 Fn 触发键，并在后台把语音键的按下/松开转换成 Fn/Globe，便于接入微信语音。";
"AhaKey Studio 帮助中心" = "AhaKey Studio 帮助中心";
"AhaKey Studio 是 AhaKey 小键盘的 macOS 配置中心" = "AhaKey Studio 是 AhaKey 小键盘的 macOS 配置中心";
"AhaKey Studio 正在连接键盘" = "AhaKey Studio 正在连接键盘";
"AhaKey Studio 正在配置键盘" = "AhaKey Studio 正在配置键盘";
"AhaKey Studio 现在会在你使用 编程工具时自动阻止 Mac 进入空闲休眠；macOS 14+ 还支持合盖后继续运行。可在顶部状态栏或「更多」里调整。" = "AhaKey Studio 现在会在你使用 编程工具时自动阻止 Mac 进入空闲休眠；macOS 14+ 还支持合盖后继续运行。可在顶部状态栏或「更多」里调整。";
"AhaKey Studio 现在会在你使用编程工具时自动阻止 Mac 进入空闲休眠；macOS 14+ 还支持合盖后继续运行。可在顶部状态栏或「更多」里调整。" = "AhaKey Studio 现在会在你使用编程工具时自动阻止 Mac 进入空闲休眠；macOS 14+ 还支持合盖后继续运行。可在顶部状态栏或「更多」里调整。";
"AhaKey Studio 等待连接键盘" = "AhaKey Studio 等待连接键盘";
"AhaKey Studio 首次使用需要完成几项系统授权：连接键盘需要蓝牙，后台接管语音键需要输入监控与辅助功能，macOS 原生语音需要麦克风、语音转写、Siri 与听写。" = "AhaKey Studio 首次使用需要完成几项系统授权：连接键盘需要蓝牙，后台接管语音键需要输入监控与辅助功能，macOS 原生语音需要麦克风、语音转写、Siri 与听写。";
"AhaKey 安全警告" = "AhaKey 安全警告";
"AhaKey 拨杆接管中：当前为{mode_label}。" = "AhaKey 拨杆接管中：当前为{mode_label}。";
"AhaType 云端地址无效，直接写入原始转写。" = "AhaType 云端地址无效，直接写入原始转写。";
"AhaType 云端整理" = "AhaType 云端整理";
"AhaType 关闭" = "AhaType 关闭";
"AhaType 处理失败，已写入原始转写。" = "AhaType 处理失败，已写入原始转写。";
"AhaType 处理失败：%@" = "AhaType 处理失败：%@";
"AhaType 已开启，但尚未登录。" = "AhaType 已开启，但尚未登录。";
"AhaType 已开启，但登录已过期。" = "AhaType 已开启，但登录已过期。";
"AhaType 已开启，语音结果会先经云端整理。" = "AhaType 已开启，语音结果会先经云端整理。";
"AhaType 已整理并写入：%@" = "AhaType 已整理并写入：%@";
"AhaType 已整理，准备粘贴。" = "AhaType 已整理，准备粘贴。";
"AhaType 开启" = "AhaType 开启";
"AhaType 整理中" = "AhaType 整理中";
"AhaType 整理中…" = "AhaType 整理中…";
"AhaType 未启用。" = "AhaType 未启用。";
"AhaType 未启用，直接写入原始转写。" = "AhaType 未启用，直接写入原始转写。";
"AhaType 未注册登录" = "AhaType 未注册登录";
"AhaType 状态" = "AhaType 状态";
"AhaType 登录已过期，直接写入原始转写。" = "AhaType 登录已过期，直接写入原始转写。";
"AhaType 缺少登录令牌，直接写入原始转写。" = "AhaType 缺少登录令牌，直接写入原始转写。";
"AhaType 网络错误，已写入原始转写。" = "AhaType 网络错误，已写入原始转写。";
"AhaType 请求失败（HTTP %d），已写入原始转写。" = "AhaType 请求失败（HTTP %d），已写入原始转写。";
"AhaType 返回空文本，已写入原始转写。" = "AhaType 返回空文本，已写入原始转写。";
"AhaType 返回缺少 data，已写入原始转写。" = "AhaType 返回缺少 data，已写入原始转写。";
"AhaType 返回非 JSON，已写入原始转写。" = "AhaType 返回非 JSON，已写入原始转写。";
"AhaType 配置写入失败。" = "AhaType 配置写入失败。";
"Auto 档的彩虹覆盖" = "Auto 档的彩虹覆盖";
"BLE 占用是一道单行道" = "BLE 占用是一道单行道";
"BLE 数据通道还没准备好。" = "BLE 数据通道还没准备好。";
"BLE 未连接" = "BLE 未连接";
"BLE 连接状态" = "BLE 连接状态";
"Breathing" = "呼吸";
"CGVirtualDisplay 创建失败" = "CGVirtualDisplay 创建失败";
"Claude / Cursor / Codex / Kimi Hook 已配置" = "Claude / Cursor / Codex / Kimi Hook 已配置";
"Claude / Cursor / Codex：按各自确认链。Kimi：若已安装 AhaKey Kimi Hooks，手动档会直接把当前会话拉回手动批准。" = "Claude / Cursor / Codex：按各自确认链。Kimi：若已安装 AhaKey Kimi Hooks，手动档会直接把当前会话拉回手动批准。";
"Claude Code · 终端权限 Y/N" = "Claude Code · 终端权限 Y/N";
"Claude Code · 终端权限菜单 Y/N。" = "Claude Code · 终端权限菜单 Y/N。";
"Claude Hooks 已写入 ~/.claude/settings.json。" = "Claude Hooks 已写入 ~/.claude/settings.json。";
"Claude Hooks：无法写入 %@。请检查该文件或父目录的权限/只读状态。" = "Claude Hooks：无法写入 %@。请检查该文件或父目录的权限/只读状态。";
"Claude Hooks：未找到 ~/.claude/settings.json，已跳过。使用 Claude Code 并生成该文件后，可再点「安装 Claude Hooks」。" = "Claude Hooks：未找到 ~/.claude/settings.json，已跳过。使用 Claude Code 并生成该文件后，可再点「安装 Claude Hooks」。";
"Claude hooks 中 ahakey 条目已移除" = "Claude hooks 中 ahakey 条目已移除";
"Claude hooks 已写入 ahakeyconfig-agent hook 子命令" = "Claude hooks 已写入 ahakeyconfig-agent hook 子命令";
"Claude/Cursor/Codex/Kimi Hook、灯条状态、拨杆查询" = "Claude/Cursor/Codex/Kimi Hook、灯条状态、拨杆查询";
"Claude：PermissionRequest allow。Cursor：preToolUse 等与 cli-config。Codex：PermissionRequest allow。Kimi：安装过 AhaKey Kimi Hooks 后，**拨杆会直接接管当前会话的自动批准**；若刚装完或刚升级 kimi-cli，请**完全关闭并重新打开一次 kimi**。钩子 stdout 只对 **`permissionDecision: deny`** 有特殊拦截语义。Agent 须在跑且蓝牙由其占用。" = "Claude：PermissionRequest allow。Cursor：preToolUse 等与 cli-config。Codex：PermissionRequest allow。Kimi：安装过 AhaKey Kimi Hooks 后，**拨杆会直接接管当前会话的自动批准**；若刚装完或刚升级 kimi-cli，请**完全关闭并重新打开一次 kimi**。钩子 stdout 只对 **`permissionDecision: deny`** 有特殊拦截语义。Agent 须在跑且蓝牙由其占用。";
"Codex Hooks 已写入 ~/.codex/config.toml。\n\n%@\n\n安装完成。请重启 Codex 终端或客户端后再使用。" = "Codex Hooks 已写入 ~/.codex/config.toml。\n\n%@\n\n安装完成。请重启 Codex 终端或客户端后再使用。";
"Codex Hooks 已写入 ~/.codex/config.toml。\n\n安装完成。请重启 Codex 终端或客户端后再使用。" = "Codex Hooks 已写入 ~/.codex/config.toml。\n\n安装完成。请重启 Codex 终端或客户端后再使用。";
"Codex Hooks：已尝试写入 %@，但校验时未发现 AhaKey 标记块。请确认对「用户主目录 /.codex」有写权限，或关闭占用该文件的其它程序。" = "Codex Hooks：已尝试写入 %@，但校验时未发现 AhaKey 标记块。请确认对「用户主目录 /.codex」有写权限，或关闭占用该文件的其它程序。";
"Codex Hooks：无法写入 %@：%@" = "Codex Hooks：无法写入 %@：%@";
"Codex Hooks：无法创建目录 %@：%@" = "Codex Hooks：无法创建目录 %@：%@";
"Codex hooks 中 AhaKey 标记块已移除" = "Codex hooks 中 AhaKey 标记块已移除";
"Codex hooks 已写入 ~/.codex/config.toml" = "Codex hooks 已写入 ~/.codex/config.toml";
"Codex · 审批 ↵ / Esc。" = "Codex · 审批 ↵ / Esc。";
"Cursor Hooks 已写入 ~/.cursor/hooks.json。" = "Cursor Hooks 已写入 ~/.cursor/hooks.json。";
"Cursor Hooks：无法写入 %@。请检查权限或磁盘空间。" = "Cursor Hooks：无法写入 %@。请检查权限或磁盘空间。";
"Cursor Hooks：无法创建目录 %@：%@" = "Cursor Hooks：无法创建目录 %@：%@";
"Cursor hooks 已写入" = "Cursor hooks 已写入";
"Cursor · ↵ 接受改动 / ⌫ 拒绝改动。" = "Cursor · ↵ 接受改动 / ⌫ 拒绝改动。";
"Cursor · ⌘↵ 接受改动 / ⌘⌫ 拒绝改动。" = "Cursor · ⌘↵ 接受改动 / ⌘⌫ 拒绝改动。";
"EchoWrite 推荐" = "EchoWrite 推荐";
"EchoWrite 推荐：Key1 发送 F18 触发随声写录音，Key2/4 确认，Key3 取消。" = "EchoWrite 推荐：Key1 发送 F18 触发随声写录音，Key2/4 确认，Key3 取消。";
"Fn F19 兼容" = "Fn F19 兼容";
"Fn 语音输入法" = "Fn 语音输入法";
"Hook 拦不住，还是会停下来问我" = "Hook 拦不住，还是会停下来问我";
"Hook 的 auto-approve 立即切换到你选的档位。持久化到 UserDefaults，agent 重启仍生效" = "Hook 的 auto-approve 立即切换到你选的档位。持久化到 UserDefaults，agent 重启仍生效";
"IDE「Not in allowlist」用 ~/.cursor/permissions.json 的 terminalAllowlist，与 userCliConfig（cli-config=CLI）分离；见 cursor.com/docs/reference/permissions" = "IDE「Not in allowlist」用 ~/.cursor/permissions.json 的 terminalAllowlist，与 userCliConfig（cli-config=CLI）分离；见 cursor.com/docs/reference/permissions";
"Key %d 设置" = "Key %d 设置";
"Key 1 / 语音键" = "Key 1 / 语音键";
"Key 2 / 通过键" = "Key 2 / 通过键";
"Key 3 / 拒绝键" = "Key 3 / 拒绝键";
"Key 4 / 删除键" = "Key 4 / 删除键";
"Kimi Hooks：无法写入 %@：%@" = "Kimi Hooks：无法写入 %@：%@";
"Kimi Hooks：无法创建目录 %@：%@" = "Kimi Hooks：无法创建目录 %@：%@";
"Kimi hooks 中 AhaKey 标记块与旧版裸 hook 已移除" = "Kimi hooks 中 AhaKey 标记块与旧版裸 hook 已移除";
"Kimi hooks 已写入 ~/.kimi/config.toml" = "Kimi hooks 已写入 ~/.kimi/config.toml";
"Kimi：若已安装 AhaKey Kimi Hooks，自动档会直接接管当前会话批准；若刚装完或刚升级 kimi-cli，请先重开一次 kimi。Claude/Cursor/Codex 仍走各自钩子。" = "Kimi：若已安装 AhaKey Kimi Hooks，自动档会直接接管当前会话批准；若刚装完或刚升级 kimi-cli，请先重开一次 kimi。Claude/Cursor/Codex 仍走各自钩子。";
"L1: 系统断言" = "L1: 系统断言";
"L2: IORegistry" = "L2: IORegistry";
"L3 禁用电量" = "L3 禁用电量";
"L3: 虚拟显示器" = "L3: 虚拟显示器";
"LCD 屏幕" = "LCD 屏幕";
"LCD 自动同步没触发" = "LCD 自动同步没触发";
"LCD 角标的含义" = "LCD 角标的含义";
"LED 测试" = "LED 测试";
"LED 状态同步 · Hook 联动" = "LED 状态同步 · Hook 联动";
"LED 跟随 IDE 状态" = "LED 跟随 IDE 状态";
"LaunchAgent 已安装" = "LaunchAgent 已安装";
"LaunchAgent 的 plist 已保存，但 launchctl load 失败，守护进程未载入。\n\nlaunchctl 输出：\n%@\n\n常见原因：同一 Label 已存在、plist 无效、对 ~/Library/LaunchAgents 无写权限。可先点「卸载」再装，或在「控制台」搜索 %@。" = "LaunchAgent 的 plist 已保存，但 launchctl load 失败，守护进程未载入。\n\nlaunchctl 输出：\n%@\n\n常见原因：同一 Label 已存在、plist 无效、对 ~/Library/LaunchAgents 无写权限。可先点「卸载」再装，或在「控制台」搜索 %@。";
"Mode 1 / Mode 2 时，固件的 update_claude_ws2812() 直接 return，**灯条不再随 IDE state 变**，会停在上一次设定的颜色上。这是固件设计，不是 bug。" = "Mode 1 / Mode 2 时，固件的 update_claude_ws2812() 直接 return，**灯条不再随 IDE state 变**，会停在上一次设定的颜色上。这是固件设计，不是 bug。";
"Mode 1 默认文案：Record / Accept / Reject / Backspace" = "Mode 1 默认文案：Record / Accept / Reject / Backspace";
"OFF (熄灭)" = "OFF (熄灭)";
"OLED 上传中" = "OLED 上传中";
"OTA 升级有吗？" = "OTA 升级有吗？";
"Off" = "关闭";
"PreToolUse — 工具开始执行（manual 档专属）" = "PreToolUse — 工具开始执行（manual 档专属）";
"SessionEnd — Claude 会话结束" = "SessionEnd — Claude 会话结束";
"Siri" = "Siri";
"Solid" = "常亮";
"Typeless / 微信语音 / 豆包输入法使用 F19 触发，并注入 Fn 按住/松开。" = "Typeless / 微信语音 / 豆包输入法使用 F19 触发，并注入 Fn 按住/松开。";
"ahakeyconfig-agent 主日志" = "ahakeyconfig-agent 主日志";
"auto 批准 vs manual 批准；详见「虚拟拨杆」章节。" = "auto 批准 vs manual 批准；详见「虚拟拨杆」章节。";
"custom · 自定义模式" = "custom · 自定义模式";
"event tap create failed (缺辅助功能或输入监控权限?)" = "event tap create failed (缺辅助功能或输入监控权限?)";
"hooks.json 中无「hooks」或为空，没有可移除的 AhaKey 项。" = "hooks.json 中无「hooks」或为空，没有可移除的 AhaKey 项。";
"kimi-cli 读 default_yolo 在 KimiCLI.create/load_config；已开着的会话请输入 /reload 即可（不必退出 kimi）。PreToolUse 仍仅 deny 会拦工具；default_yolo 管交互批准层。" = "kimi-cli 读 default_yolo 在 KimiCLI.create/load_config；已开着的会话请输入 /reload 即可（不必退出 kimi）。PreToolUse 仍仅 deny 会拦工具；default_yolo 管交互批准层。";
"launchctl load 已执行。若数秒后未显示「运行中」，请点「查看日志」。" = "launchctl load 已执行。若数秒后未显示「运行中」，请点「查看日志」。";
"macOS 原生语音" = "macOS 原生语音";
"macOS 原生语音走 F18；Fn / Globe 触发走 F19" = "macOS 原生语音走 F18；Fn / Globe 触发走 F19";
"macOS 原生语音默认 F18；Typeless / 微信的 Fn 触发使用 F19。" = "macOS 原生语音默认 F18；Typeless / 微信的 Fn 触发使用 F19。";
"macOS 原生转写" = "macOS 原生转写";
"removeClaudeHooks: 无法写回 settings" = "removeClaudeHooks: 无法写回 settings";
"removeCursorHooks: 无法写回 hooks.json" = "removeCursorHooks: 无法写回 hooks.json";
"socket() 失败" = "socket() 失败";
"sudo 执行失败: %@" = "sudo 执行失败: %@";
"v%d.%d" = "v%d.%d";
"→ 重读电池电量" = "→ 重读电池电量";
"═══ 开始探测 ═══" = "═══ 开始探测 ═══";
"═══ 探测完毕，等待回调 ═══" = "═══ 探测完毕，等待回调 ═══";
"⚙️ 重置开发环境签名（通常不需要）" = "⚙️ 重置开发环境签名（通常不需要）";
"✓ 已上传 %d 帧" = "✓ 已上传 %d 帧";
"、" = "、";
"三件套是怎么协同的" = "三件套是怎么协同的";
"上一步" = "上一步";
"上传到设备" = "上传到设备";
"下一步" = "下一步";
"下面是 Mode 1（Claude）下，固件按 IDE state 的实际行为：" = "下面是 Mode 1（Claude）下，固件按 IDE state 的实际行为：";
"不点亮灯条。" = "不点亮灯条。";
"与「设备信息 · Agent」中的启动相同，由 launchd 加载并执行 ahakeyconfig-agent。" = "与「设备信息 · Agent」中的启动相同，由 launchd 加载并执行 ahakeyconfig-agent。";
"两档分别管什么" = "两档分别管什么";
"中心快速脉冲扩散。" = "中心快速脉冲扩散。";
"中心脉冲" = "中心脉冲";
"中间停住" = "中间停住";
"中间最亮，两侧渐弱，适合停住提示。" = "中间最亮，两侧渐弱，适合停住提示。";
"中间那个像键盘的图就是你的小键盘 1:1 镜像，所有元件可点" = "中间那个像键盘的图就是你的小键盘 1:1 镜像，所有元件可点";
"临时由 AhaKey Studio 接管蓝牙，用于改键、LCD、同步和本机灯效测试。" = "临时由 AhaKey Studio 接管蓝牙，用于改键、LCD、同步和本机灯效测试。";
"主键" = "主键";
"乐观显示中" = "乐观显示中";
"乐观更新画布" = "乐观更新画布";
"云端地址无效。" = "云端地址无效。";
"云端整理已启用" = "云端整理已启用";
"云端未返回 access_token。" = "云端未返回 access_token。";
"云端未返回可支付链接。" = "云端未返回可支付链接。";
"云端未返回订单号，无法查询支付状态。" = "云端未返回订单号，无法查询支付状态。";
"云端正在优化文本" = "云端正在优化文本";
"云端账号" = "云端账号";
"云端账号 · AhaType" = "云端账号 · AhaType";
"云端账号 · AhaType…" = "云端账号 · AhaType…";
"云端连接失败：%@" = "云端连接失败：%@";
"云端连接失败：TLS/SSL 校验未通过，请检查系统时间、网络代理/证书，或确认云端 HTTPS 证书配置正常。" = "云端连接失败：TLS/SSL 校验未通过，请检查系统时间、网络代理/证书，或确认云端 HTTPS 证书配置正常。";
"云端连接失败：当前网络无法访问 AhaType 服务，请检查网络后重试。" = "云端连接失败：当前网络无法访问 AhaType 服务，请检查网络后重试。";
"亮度" = "亮度";
"亮度 %d%%" = "亮度 %d%%";
"仅 Agent 连接蓝牙。Claude/Cursor/Codex/Kimi Code CLI Hook 才能驱动灯条与拨杆查询；本 App 里无法对键盘发 BLE 命令。" = "仅 Agent 连接蓝牙。Claude/Cursor/Codex/Kimi Code CLI Hook 才能驱动灯条与拨杆查询；本 App 里无法对键盘发 BLE 命令。";
"仅在异常情况下使用：证书过期 / 换 Mac / Team ID 变化 / 钥匙串损坏导致权限失效时，点一下会重新签名 app 并重置 TCC 授权。正式发行版（无源码目录）看不到此按钮。" = "仅在异常情况下使用：证书过期 / 换 Mac / Team ID 变化 / 钥匙串损坏导致权限失效时，点一下会重新签名 app 并重置 TCC 授权。正式发行版（无源码目录）看不到此按钮。";
"仍有权限未开启。请按上方状态逐项处理，全部变为绿色后再关闭弹窗。" = "仍有权限未开启。请按上方状态逐项处理，全部变为绿色后再关闭弹窗。";
"仍缺语音权限" = "仍缺语音权限";
"从 launchd 加载并启动/卸载停止 Agent 进程。" = "从 launchd 加载并启动/卸载停止 Agent 进程。";
"从中心向两侧扩散的涟漪效果。" = "从中心向两侧扩散的涟漪效果。";
"以下权限点击「申请」后会弹出系统对话框，直接点允许即可。" = "以下权限点击「申请」后会弹出系统对话框，直接点允许即可。";
"以下权限需要前往系统设置手动开启，点击「打开设置」后在系统设置中操作。" = "以下权限需要前往系统设置手动开启，点击「打开设置」后在系统设置中操作。";
"任务可能随休眠中断" = "任务可能随休眠中断";
"任务完成" = "任务完成";
"任务状态动图" = "任务状态动图";
"任务状态动图已写入设备。" = "任务状态动图已写入设备。";
"任务状态图每张最多 30 帧（超出自动均匀抽帧），源文件 ≤ 2 MB，FPS 5–20。" = "任务状态图每张最多 30 帧（超出自动均匀抽帧），源文件 ≤ 2 MB，FPS 5–20。";
"优先用来触发语音输入，用户在软件里看到的是语音软件名，底层仍写成快捷键。" = "优先用来触发语音输入，用户在软件里看到的是语音软件名，底层仍写成快捷键。";
"会话开始" = "会话开始";
"会话结束" = "会话结束";
"低电量" = "低电量";
"体验输入" = "体验输入";
"作用范围" = "作用范围";
"使用 AhaType 整理" = "使用 AhaType 整理";
"例如 Record / Accept / Reject / Backspace" = "例如 Record / Accept / Reject / Backspace";
"依 Mode 默认：N / ⌫ / Esc。可改成宏序列。" = "依 Mode 默认：N / ⌫ / Esc。可改成宏序列。";
"依 Mode 默认：Y / ↵ / ↵。可改成宏序列。" = "依 Mode 默认：Y / ↵ / ↵。可改成宏序列。";
"保存" = "保存";
"保存 %@ 当前配置" = "保存 %@ 当前配置";
"保存全部配置到设备" = "保存全部配置到设备";
"保存配置" = "保存配置";
"保存配置到设备…" = "保存配置到设备…";
"信号" = "信号";
"修复失败" = "修复失败";
"修复完成" = "修复完成";
"修改" = "修改";
"修改会先保存在本地，连接设备后再同步。" = "修改会先保存在本地，连接设备后再同步。";
"修饰键" = "修饰键";
"候选文件格式校验失败，未替换原配置" = "候选文件格式校验失败，未替换原配置";
"停止" = "停止";
"允许 AhaKey Studio 使用苹果原生语音识别。" = "允许 AhaKey Studio 使用苹果原生语音识别。";
"允许 AhaKey Studio 使用苹果原生语音采集。" = "允许 AhaKey Studio 使用苹果原生语音采集。";
"允许 AhaKey Studio 在后台监听实体语音键；设置完成后通常需要退出并重新打开。" = "允许 AhaKey Studio 在后台监听实体语音键；设置完成后通常需要退出并重新打开。";
"允许 AhaKey Studio 扫描并连接 AhaKey 键盘。" = "允许 AhaKey Studio 扫描并连接 AhaKey 键盘。";
"允许 AhaKey Studio 把语音键转换成 macOS 原生转写或 Fn/Globe。" = "允许 AhaKey Studio 把语音键转换成 macOS 原生转写或 Fn/Globe。";
"允许 AhaKey Studio 把语音键转换成苹果原生转写或 Fn/Globe。" = "允许 AhaKey Studio 把语音键转换成苹果原生转写或 Fn/Globe。";
"充值到账已刷新。" = "充值到账已刷新。";
"充值成功，正在刷新额度。" = "充值成功，正在刷新额度。";
"充值订阅" = "充值订阅";
"充电流动" = "充电流动";
"先完成弹窗确认的权限" = "先完成弹窗确认的权限";
"先完成蓝牙、麦克风、语音转写等弹窗授权，再依次开启 Siri、听写、辅助功能，最后处理输入监控并重启。" = "先完成蓝牙、麦克风、语音转写等弹窗授权，再依次开启 Siri、听写、辅助功能，最后处理输入监控并重启。";
"免费券兑换码" = "免费券兑换码";
"免费券已生效。" = "免费券已生效。";
"兑换" = "兑换";
"兑换失败" = "兑换失败";
"兑换失败。" = "兑换失败。";
"兑换成功。" = "兑换成功。";
"全部松开" = "全部松开";
"六大热区" = "六大热区";
"关闭" = "关闭";
"关闭合盖运行" = "关闭合盖运行";
"关闭订单" = "关闭订单";
"内容" = "内容";
"内容已改" = "内容已改";
"再到系统设置中开启" = "再到系统设置中开启";
"再次按语音键结束" = "再次按语音键结束";
"再次申请权限" = "再次申请权限";
"写 cli-config（CLI）与 permissions.json 的 terminalAllowlist（Agent TUI「Not in allowlist」层）；分见官方文档。均先备份为 .ahakey.bak。" = "写 cli-config（CLI）与 permissions.json 的 terminalAllowlist（Agent TUI「Not in allowlist」层）；分见官方文档。均先备份为 .ahakey.bak。";
"写入 %@ %@ 宏: %@" = "写入 %@ %@ 宏: %@";
"写入 %@ %@ 快捷键" = "写入 %@ %@ 快捷键";
"写入 %@ %@ 快捷键: %@" = "写入 %@ %@ 快捷键: %@";
"写入 %@ %@ 描述: %@" = "写入 %@ %@ 描述: %@";
"写入中…" = "写入中…";
"写入失败" = "写入失败";
"写入结果" = "写入结果";
"写入键盘" = "写入键盘";
"写入键盘失败：%@" = "写入键盘失败：%@";
"准备粘贴" = "准备粘贴";
"准备粘贴…" = "准备粘贴…";
"几种预设的差别" = "几种预设的差别";
"出厂默认 Backspace，适合删除、撤销输入或清理当前内容。" = "出厂默认 Backspace，适合删除、撤销输入或清理当前内容。";
"分步授权" = "分步授权";
"切换 Mode 时 LCD 会先闪一下当前按键 description 文本（机械感效果），约 1 秒后回到该 Mode 的图片。" = "切换 Mode 时 LCD 会先闪一下当前按键 description 文本（机械感效果），约 1 秒后回到该 Mode 的图片。";
"切换为中文" = "切换为中文";
"切换为英文" = "切换为英文";
"切换到当前模式时，LCD 会先显示该模式的按键描述，约 1 秒后回到该模式图片。" = "切换到当前模式时，LCD 会先显示该模式的按键描述，约 1 秒后回到该模式图片。";
"切换方式：键盘上的 Mode 拨杆，或主 App 顶部 Picker，或点画布上的 Mode 按钮。三处任一改动会同步另外两个。" = "切换方式：键盘上的 Mode 拨杆，或主 App 顶部 Picker，或点画布上的 Mode 按钮。三处任一改动会同步另外两个。";
"切换模式时会先显示按键描述，再回到 Mode 1 默认图片。" = "切换模式时会先显示按键描述，再回到 Mode 1 默认图片。";
"切换账号" = "切换账号";
"创建支付订单失败" = "创建支付订单失败";
"创建支付订单失败。" = "创建支付订单失败。";
"删除" = "删除";
"删除键" = "删除键";
"刷新" = "刷新";
"刷新 AhaType 状态" = "刷新 AhaType 状态";
"刷新到账" = "刷新到账";
"刷新失败。" = "刷新失败。";
"刷新本页" = "刷新本页";
"动图" = "动图";
"动画管理" = "动画管理";
"动画需要 %d 帧，但设备当前没有足够连续空间。总容量上限约为 %d 帧。" = "动画需要 %d 帧，但设备当前没有足够连续空间。总容量上限约为 %d 帧。";
"包季充值" = "包季充值";
"包年充值" = "包年充值";
"包月充值" = "包月充值";
"单点来回移动，适合运行中。" = "单点来回移动，适合运行中。";
"单键 / 组合键" = "单键 / 组合键";
"卸载" = "卸载";
"原因：" = "原因：";
"发版包内未包含 ahakeyconfig-agent，无法使用守护进程。请用完整「AhaKey Studio.app」或联系开发者。" = "发版包内未包含 ahakeyconfig-agent，无法使用守护进程。请用完整「AhaKey Studio.app」或联系开发者。";
"发送 AA BB 00 CC DD 查询设备状态" = "发送 AA BB 00 CC DD 查询设备状态";
"取消" = "取消";
"取消写入" = "取消写入";
"取消键" = "取消键";
"只要 AhaKey Studio 在后台运行，Mode 1 出厂语音键发出的 F18 就会被直接接管到苹果原生转写。现在不再依赖系统听写快捷键。" = "只要 AhaKey Studio 在后台运行，Mode 1 出厂语音键发出的 F18 就会被直接接管到苹果原生转写。现在不再依赖系统听写快捷键。";
"合并 CLI + IDE 终端白名单" = "合并 CLI + IDE 终端白名单";
"合并后的 JSON 无法写回：%@" = "合并后的 JSON 无法写回：%@";
"合盖也运行" = "合盖也运行";
"合盖保护" = "合盖保护";
"合盖后也继续运行" = "合盖后也继续运行";
"合盖运行关闭" = "合盖运行关闭";
"合盖运行开启" = "合盖运行开启";
"合盖运行设置" = "合盖运行设置";
"合盖运行设置…" = "合盖运行设置…";
"同一时间只能由本 App 或 Agent 其中之一连接键盘，请在此切换。" = "同一时间只能由本 App 或 Agent 其中之一连接键盘，请在此切换。";
"同步中…" = "同步中…";
"同步到键盘后，短按实体键切换模式时，LCD 会先短暂显示这里的描述，然后回到该模式的图片。" = "同步到键盘后，短按实体键切换模式时，LCD 会先短暂显示这里的描述，然后回到该模式的图片。";
"后台监听中" = "后台监听中";
"后台监听已启动。Fn/Globe 语音走 F19；macOS 原生与旧版 F18 会继续兼容。" = "后台监听已启动。Fn/Globe 语音走 F19；macOS 原生与旧版 F18 会继续兼容。";
"后台监听已启动，但当前没有可接管的语音软件。" = "后台监听已启动，但当前没有可接管的语音软件。";
"后台语音桥" = "后台语音桥";
"后台轮询中，尝试寻找设备…" = "后台轮询中，尝试寻找设备…";
"后续会继续增加文字状态、token 用量、模型环境等信息显示能力。" = "后续会继续增加文字状态、token 用量、模型环境等信息显示能力。";
"向设备发送探测命令，观察通信日志中的回调" = "向设备发送探测命令，观察通信日志中的回调";
"否" = "否";
"听写" = "听写";
"启动" = "启动";
"启动 Agent" = "启动 Agent";
"启用 AhaType 云端整理" = "启用 AhaType 云端整理";
"周" = "周";
"命令特征(0x7343) 就绪" = "命令特征(0x7343) 就绪";
"命令通道就绪" = "命令通道就绪";
"命令通道未就绪" = "命令通道未就绪";
"四个 Mode" = "四个 Mode";
"回车" = "回车";
"固件" = "固件";
"固件升级中" = "固件升级中";
"固件宏" = "固件宏";
"固件宏（%d 步）" = "固件宏（%d 步）";
"固件按顺序串行发送；延时单位 3ms（最大 765ms）。需要更长延时请叠加多个延时步骤。" = "固件按顺序串行发送；延时单位 3ms（最大 765ms）。需要更长延时请叠加多个延时步骤。";
"图片" = "图片";
"图片写入已取消。已完成的图片会保留，未完成的图片可稍后继续写入。" = "图片写入已取消。已完成的图片会保留，未完成的图片可稍后继续写入。";
"图片文件不符合上传限制。" = "图片文件不符合上传限制。";
"图片显示" = "图片显示";
"图片源文件约 %@，超过单文件上限 %@。请压缩分辨率、减少帧数或缩短图片后再试。" = "图片源文件约 %@，超过单文件上限 %@。请压缩分辨率、减少帧数或缩短图片后再试。";
"图片管理" = "图片管理";
"在 %@ 中**未发现**包含 `ahakeyconfig-agent` 或 `ahakey-state` 的 `command`。\n\n若 Hook 在**项目级** `.cursor/hooks.json`，请在该仓库内手动删除；本按钮只改用户级 `~/.cursor/hooks.json`。" = "在 %@ 中**未发现**包含 `ahakeyconfig-agent` 或 `ahakey-state` 的 `command`。\n\n若 Hook 在**项目级** `.cursor/hooks.json`，请在该仓库内手动删除；本按钮只改用户级 `~/.cursor/hooks.json`。";
"在 %@ 中未发现 AhaKey Codex hook 标记块。" = "在 %@ 中未发现 AhaKey Codex hook 标记块。";
"在 %@ 中未发现 AhaKey Kimi hook 标记块或旧版裸 hook。" = "在 %@ 中未发现 AhaKey Kimi hook 标记块或旧版裸 hook。";
"在「系统设置 > Siri 与聚焦」里开启 Siri，供 macOS 原生语音能力使用。" = "在「系统设置 > Siri 与聚焦」里开启 Siri，供 macOS 原生语音能力使用。";
"在「系统设置 > 键盘 > 听写」里开启听写，保证系统语音组件完整可用。" = "在「系统设置 > 键盘 > 听写」里开启听写，保证系统语音组件完整可用。";
"在「隐私与安全性 > 蓝牙」中允许 AhaKey Studio 使用蓝牙。" = "在「隐私与安全性 > 蓝牙」中允许 AhaKey Studio 使用蓝牙。";
"在系统设置 > Siri 与聚焦里开启 Siri。" = "在系统设置 > Siri 与聚焦里开启 Siri。";
"在系统设置 > 键盘 > 听写里开启听写。" = "在系统设置 > 键盘 > 听写里开启听写。";
"在系统设置中修改权限后，需重启本应用，检测才会与系统一致。" = "在系统设置中修改权限后，需重启本应用，检测才会与系统一致。";
"在这台 Mac 上设置 AhaKey" = "在这台 Mac 上设置 AhaKey";
"备份 %@ 失败：%@" = "备份 %@ 失败：%@";
"复制全部" = "复制全部";
"复制支付链接" = "复制支付链接";
"外发 / DMG / Xcode：默认正式包在系统「隐私与安全性」里显示为「AhaKey Studio」；用 Xcode 以 Debug 运行本工程时显示为「AhaKey Studio（调试）」，请按名称分别授权。路径或签名不同也会被系统当成另一款 App。" = "外发 / DMG / Xcode：默认正式包在系统「隐私与安全性」里显示为「AhaKey Studio」；用 Xcode 以 Debug 运行本工程时显示为「AhaKey Studio（调试）」，请按名称分别授权。路径或签名不同也会被系统当成另一款 App。";
"好" = "好";
"如何使用" = "如何使用";
"如何理解这个部件" = "如何理解这个部件";
"如果下面没你的问题，可以提 issue 到 GitHub 仓库" = "如果下面没你的问题，可以提 issue 到 GitHub 仓库";
"始终允许（忽略所有限制）" = "始终允许（忽略所有限制）";
"安全阈值" = "安全阈值";
"安全阈值触发：已降级合盖保护" = "安全阈值触发：已降级合盖保护";
"安全阈值触发：已降级合盖运行" = "安全阈值触发：已降级合盖运行";
"安装 Agent + Hook" = "安装 Agent + Hook";
"安装 Claude Hooks" = "安装 Claude Hooks";
"安装 Codex Hooks" = "安装 Codex Hooks";
"安装 Cursor Hooks" = "安装 Cursor Hooks";
"安装 Kimi Hooks" = "安装 Kimi Hooks";
"安装/修复 Agent 与 Hook，并启动 Agent 控制键盘。" = "安装/修复 Agent 与 Hook，并启动 Agent 控制键盘。";
"安装启动" = "安装启动";
"安装启动后才能控制键盘" = "安装启动后才能控制键盘";
"安装完成。" = "安装完成。";
"安装并启用" = "安装并启用";
"完全释放电量" = "完全释放电量";
"完成" = "完成";
"完成编辑" = "完成编辑";
"完成键盘连接、后台语音键接管、macOS 原生语音和一次真实输入体验。" = "完成键盘连接、后台语音键接管、macOS 原生语音和一次真实输入体验。";
"宏" = "宏";
"宏：%@" = "宏：%@";
"实时控制当前前台 Kimi" = "实时控制当前前台 Kimi";
"实时档位" = "实时档位";
"实验功能" = "实验功能";
"密码" = "密码";
"将先退出本应用，再自动重新打开。重新打开后「重新检查权限」会读取最新系统状态。" = "将先退出本应用，再自动重新打开。重新打开后「重新检查权限」会读取最新系统状态。";
"将当前草稿同步到键盘，然后把蓝牙交还给 Agent。" = "将当前草稿同步到键盘，然后把蓝牙交还给 Agent。";
"将蓝牙交给 `ahakeyconfig-agent` 前，请先在下方完成「安装并启用」，生成 LaunchAgent。" = "将蓝牙交给 `ahakeyconfig-agent` 前，请先在下方完成「安装并启用」，生成 LaunchAgent。";
"尚无记录。在 Claude 中触发 PermissionRequest，在 Cursor 中让 Agent 调工具/Shell/MCP，或在 Kimi Code CLI 中触发工具调用后，会在此追加带 `ide` / `hookEvent` 的 JSON 行。若始终为空，请确认已安装 Agent、Hooks、蓝牙由 Agent 占用，且 `~/Library/.../AhaKeyConfig/diagnostics/` 可写。" = "尚无记录。在 Claude 中触发 PermissionRequest，在 Cursor 中让 Agent 调工具/Shell/MCP，或在 Kimi Code CLI 中触发工具调用后，会在此追加带 `ide` / `hookEvent` 的 JSON 行。若始终为空，请确认已安装 Agent、Hooks、蓝牙由 Agent 占用，且 `~/Library/.../AhaKeyConfig/diagnostics/` 可写。";
"尚无记录。触发 Codex 后应在此追加 JSON 行。若终端 Codex 有记录、Codex 客户端没有记录，说明客户端未加载当前 `~/.codex/config.toml` hook，通常需要重启 Codex 客户端/新开终端后再测。" = "尚无记录。触发 Codex 后应在此追加 JSON 行。若终端 Codex 有记录、Codex 客户端没有记录，说明客户端未加载当前 `~/.codex/config.toml` hook，通常需要重启 Codex 客户端/新开终端后再测。";
"尚未安装 Agent，无法切回「键盘控制中」。请在「更多 → 设备信息 · Agent」里先安装并启用 Agent。" = "尚未安装 Agent，无法切回「键盘控制中」。请在「更多 → 设备信息 · Agent」里先安装并启用 Agent。";
"尚未安装 LaunchAgent。请先点「安装并启用」。" = "尚未安装 LaunchAgent。请先点「安装并启用」。";
"尚未查询" = "尚未查询";
"尚未检查权限。" = "尚未检查权限。";
"尚未检查麦克风、语音转写与 Siri 权限。" = "尚未检查麦克风、语音转写与 Siri 权限。";
"尚未登录。" = "尚未登录。";
"尚未读取 AhaType 配置。" = "尚未读取 AhaType 配置。";
"尝试自动重连…" = "尝试自动重连…";
"就绪" = "就绪";
"展开下拉列表" = "展开下拉列表";
"工作中" = "工作中";
"工作模式" = "工作模式";
"工具完毕" = "工具完毕";
"工具执行" = "工具执行";
"工具批准（permission-request.log）" = "工具批准（permission-request.log）";
"已上传 %d 个 LCD 动图，正在写入灯效与键位配置（约 %d 条）…" = "已上传 %d 个 LCD 动图，正在写入灯效与键位配置（约 %d 条）…";
"已上传 %d 个 LCD 图片，正在写入灯效与键位配置（约 %d 条）…" = "已上传 %d 个 LCD 图片，正在写入灯效与键位配置（约 %d 条）…";
"已上传 %d 帧到设备，槽位起点 %d；切换模式时会先显示描述，再回到当前模式图片。" = "已上传 %d 帧到设备，槽位起点 %d；切换模式时会先显示描述，再回到当前模式图片。";
"已从 %@ 移除 AhaKey Codex Hooks。" = "已从 %@ 移除 AhaKey Codex Hooks。";
"已从 %@ 移除 AhaKey Kimi Hooks。" = "已从 %@ 移除 AhaKey Kimi Hooks。";
"已从用户级 Cursor Hooks 中移除 AhaKey 相关条目（共 %@ 条子命令）。\n\n文件：%@\n\n若某仓库仍有**项目级** `.cursor/hooks.json` 且其中含有本工具，其优先级可能更高，需在该项目内同步删除或合并。" = "已从用户级 Cursor Hooks 中移除 AhaKey 相关条目（共 %@ 条子命令）。\n\n文件：%@\n\n若某仓库仍有**项目级** `.cursor/hooks.json` 且其中含有本工具，其优先级可能更高，需在该项目内同步删除或合并。";
"已停止" = "已停止";
"已全部写入设备并保存。" = "已全部写入设备并保存。";
"已关闭支付订单。" = "已关闭支付订单。";
"已写入" = "已写入";
"已写入：%@" = "已写入：%@";
"已写回：%@\n（此前若存在同路径文件，已备份为 %@.ahakey.bak）\n\n本次在 permissions.allow 中新增合并 %@ 条常见 Shell(...) 规则（已有规则保留）；approvalMode 已设为 auto。\n\n若某版本仍弹窗，请把仍被拦的命令首词对照文档自行追加白名单：\nhttps://cursor.com/docs/cli/reference/permissions\n或检查工作区 .cursor/cli.json 是否另有限制。" = "已写回：%@\n（此前若存在同路径文件，已备份为 %@.ahakey.bak）\n\n本次在 permissions.allow 中新增合并 %@ 条常见 Shell(...) 规则（已有规则保留）；approvalMode 已设为 auto。\n\n若某版本仍弹窗，请把仍被拦的命令首词对照文档自行追加白名单：\nhttps://cursor.com/docs/cli/reference/permissions\n或检查工作区 .cursor/cli.json 是否另有限制。";
"已写回：%@（备份为 %@.ahakey.bak）\n\n本次在 terminalAllowlist 中新增合并 %@ 条前缀；用于 Agent 内「Not in allowlist」层，与 cli-config 的 Shell(...) 是两套。文档：\nhttps://cursor.com/docs/reference/permissions" = "已写回：%@（备份为 %@.ahakey.bak）\n\n本次在 terminalAllowlist 中新增合并 %@ 条前缀；用于 Agent 内「Not in allowlist」层，与 cli-config 的 Shell(...) 是两套。文档：\nhttps://cursor.com/docs/reference/permissions";
"已切换 Fn 按住状态；请在 Typeless/微信语音/豆包输入法内把快捷键设为 Fn/Globe（本 Studio 监听 F19，旧版 F18 兼容）。再点一次为松开。" = "已切换 Fn 按住状态；请在 Typeless/微信语音/豆包输入法内把快捷键设为 Fn/Globe（本 Studio 监听 F19，旧版 F18 兼容）。再点一次为松开。";
"已切换「苹果原生转写」录制状态（与界面「开始录音」相同）。" = "已切换「苹果原生转写」录制状态（与界面「开始录音」相同）。";
"已创建 %@，但无法更新 ~/.zshrc：%@。请手动把 `~/.local/bin` 加入 PATH。" = "已创建 %@，但无法更新 ~/.zshrc：%@。请手动把 `~/.local/bin` 加入 PATH。";
"已删除内存中的 AhaKey 条目，但**无法写回** %@。请检查对「用户目录下 .cursor」的写权限，或关闭占用该文件的其他应用后重试。" = "已删除内存中的 AhaKey 条目，但**无法写回** %@。请检查对「用户目录下 .cursor」的写权限，或关闭占用该文件的其他应用后重试。";
"已卸载 agent + hooks" = "已卸载 agent + hooks";
"已发送" = "已发送";
"已存在 %@ 但无法复制备份到 %@：%@" = "已存在 %@ 但无法复制备份到 %@：%@";
"已存在 permissions.json 但无法备份到 %@：%@" = "已存在 permissions.json 但无法备份到 %@：%@";
"已完成 / 停止" = "已完成 / 停止";
"已开启" = "已开启";
"已执行 launchctl load / start，但尚未检测到 Agent 在运行（未出现 %@）。\n\n" = "已执行 launchctl load / start，但尚未检测到 Agent 在运行（未出现 %@）。\n\n";
"已授权但蓝牙关闭" = "已授权但蓝牙关闭";
"已授权，但系统蓝牙当前关闭，请在控制中心或系统设置中打开。" = "已授权，但系统蓝牙当前关闭，请在控制中心或系统设置中打开。";
"已断开" = "已断开";
"已断开，2s 后重连" = "已断开，2s 后重连";
"已更新 %@ 的 %@ 预览；写入设备请使用底部通用按钮。" = "已更新 %@ 的 %@ 预览；写入设备请使用底部通用按钮。";
"已更新 %@ 的 LCD 预览；写入设备请使用底部通用按钮。" = "已更新 %@ 的 LCD 预览；写入设备请使用底部通用按钮。";
"已更新亮度为 %d%%；连接键盘后可预览到设备。" = "已更新亮度为 %d%%；连接键盘后可预览到设备。";
"已更新虚拟灯效预览；连接键盘后可预览到设备。" = "已更新虚拟灯效预览；连接键盘后可预览到设备。";
"已检测到 Codex App 自带 CLI，并修复终端命令：\n%@ → %@\n\n已将 `~/.local/bin` 加入 ~/.zshrc（若原文件存在，已备份为 ~/.zshrc.ahakey.bak）。" = "已检测到 Codex App 自带 CLI，并修复终端命令：\n%@ → %@\n\n已将 `~/.local/bin` 加入 ~/.zshrc（若原文件存在，已备份为 ~/.zshrc.ahakey.bak）。";
"已检测到 Codex App 自带 CLI，并创建终端命令：\n%@ → %@" = "已检测到 Codex App 自带 CLI，并创建终端命令：\n%@ → %@";
"已清空 %@，写入设备后生效。" = "已清空 %@，写入设备后生效。";
"已生成移除后的内容，但无法写回 %@：%@" = "已生成移除后的内容，但无法写回 %@：%@";
"已生效" = "已生效";
"已用 %d · 无上限" = "已用 %d · 无上限";
"已由本 App 占用蓝牙：要让 Agent 接管，请将「蓝牙连接」选为 ahakeyconfig-agent。" = "已由本 App 占用蓝牙：要让 Agent 接管，请将「蓝牙连接」选为 ahakeyconfig-agent。";
"已登录，点击刷新获取用户信息。" = "已登录，点击刷新获取用户信息。";
"已登录，用户信息稍后可刷新。" = "已登录，用户信息稍后可刷新。";
"已登录，等待刷新用户信息。" = "已登录，等待刷新用户信息。";
"已自动同步默认动图（%d 帧）。" = "已自动同步默认动图（%d 帧）。";
"已自动同步默认图片（%d 帧）。" = "已自动同步默认图片（%d 帧）。";
"已返回键盘控制，Agent 将接管蓝牙。" = "已返回键盘控制，Agent 将接管蓝牙。";
"已进入编辑配置，AhaKey Studio 将临时接管蓝牙。" = "已进入编辑配置，AhaKey Studio 将临时接管蓝牙。";
"已连接" = "已连接";
"已连蓝牙" = "已连蓝牙";
"已退出登录。" = "已退出登录。";
"已选 %d 帧图片预览；写入时将上传到 %@ 固定分区。" = "已选 %d 帧图片预览；写入时将上传到 %@ 固定分区。";
"已选 %d 帧图片：%@。" = "已选 %d 帧图片：%@。";
"已通知键盘切换到 %@。" = "已通知键盘切换到 %@。";
"已重新发送 %@ 当前模式。" = "已重新发送 %@ 当前模式。";
"带拖尾的单向扫过，像彗星。" = "带拖尾的单向扫过，像彗星。";
"帧数超过设备上限，最多支持 %d 帧。" = "帧数超过设备上限，最多支持 %d 帧。";
"帮助中心" = "帮助中心";
"常见问题" = "常见问题";
"应用全部键位到设备" = "应用全部键位到设备";
"应用包内没有可执行的 ahakeyconfig-agent（路径：…/Contents/MacOS/ahakeyconfig-agent）。请确认发版脚本已把该二进制一并打进 .app；仅有主程序时无法安装守护进程。" = "应用包内没有可执行的 ahakeyconfig-agent（路径：…/Contents/MacOS/ahakeyconfig-agent）。请确认发版脚本已把该二进制一并打进 .app；仅有主程序时无法安装守护进程。";
"底层 HID" = "底层 HID";
"延时" = "延时";
"开发中" = "开发中";
"开启合盖运行" = "开启合盖运行";
"开启后，macOS 原生语音转写会先经过 AhaType 云端整理，再粘贴到当前光标。" = "开启后，macOS 原生语音转写会先经过 AhaType 云端整理，再粘贴到当前光标。";
"开启后，macOS 原生语音转写完成后会先请求云端整理，再粘贴整理后的文本。未登录、过期或网络失败时会自动回退原始转写。" = "开启后，macOS 原生语音转写完成后会先请求云端整理，再粘贴整理后的文本。未登录、过期或网络失败时会自动回退原始转写。";
"开启后，使用 编程工具时 Mac 不会进入空闲休眠；macOS 14+ 还可合盖继续运行。" = "开启后，使用 编程工具时 Mac 不会进入空闲休眠；macOS 14+ 还可合盖继续运行。";
"开启后，使用编程工具时 Mac 不会进入空闲休眠；macOS 14+ 还可合盖继续运行。" = "开启后，使用编程工具时 Mac 不会进入空闲休眠；macOS 14+ 还可合盖继续运行。";
"开启蓝牙后，AhaKey Studio 会接管出厂语音键并同步当前 Mode。" = "开启蓝牙后，AhaKey Studio 会接管出厂语音键并同步当前 Mode。";
"开始体验" = "开始体验";
"开始录音" = "开始录音";
"开始扫描 AhaKey 设备…" = "开始扫描 AhaKey 设备…";
"开始扫描…" = "开始扫描…";
"开始设置" = "开始设置";
"开始试说" = "开始试说";
"引导分两步授权：先完成系统弹窗确认的权限，再前往系统设置开启其余权限，最后体验输入。" = "引导分两步授权：先完成系统弹窗确认的权限，再前往系统设置开启其余权限，最后体验输入。";
"弹窗授权" = "弹窗授权";
"当前" = "当前";
"当前为组合键（%@）。若你只想发单键 Enter，勿打开 ⌘/⌃ 等，或点「清除修饰键」后再选 Enter。" = "当前为组合键（%@）。若你只想发单键 Enter，勿打开 ⌘/⌃ 等，或点「清除修饰键」后再选 Enter。";
"当前仅支持动图" = "当前仅支持动图";
"当前仅支持图片" = "当前仅支持图片";
"当前会把快捷键和按键描述一起写入键盘。切换模式时，设备会先显示描述，再回到该模式的 LCD 图片。" = "当前会把快捷键和按键描述一起写入键盘。切换模式时，设备会先显示描述，再回到该模式的 LCD 图片。";
"当前图片共有 %d 帧，超过单模式上限 %d 帧。请减少帧数或缩短图片后再试。" = "当前图片共有 %d 帧，超过单模式上限 %d 帧。请减少帧数或缩短图片后再试。";
"当前档位" = "当前档位";
"当前模式没有语音路由：Fn 请选 Fn/Globe，或把「自定义快捷键」设为 F19。" = "当前模式没有语音路由：Fn 请选 Fn/Globe，或把「自定义快捷键」设为 F19。";
"当前模式的 LCD 图片" = "当前模式的 LCD 图片";
"当前模式还未上传图片，后续可替换成你的自定义图片。" = "当前模式还未上传图片，后续可替换成你的自定义图片。";
"当前状态" = "当前状态";
"当前生效值" = "当前生效值";
"当前由本 App 占用蓝牙。请打开下方「设备信息…」，在「蓝牙连接」里选「由 Agent 占用」后再启 Agent；与设备信息里「启动」按钮规则一致。" = "当前由本 App 占用蓝牙。请打开下方「设备信息…」，在「蓝牙连接」里选「由 Agent 占用」后再启 Agent；与设备信息里「启动」按钮规则一致。";
"当前由本 App 占用蓝牙，Agent 应处于未加载。请先在「蓝牙连接」中选中 Agent 后再启停守护进程。" = "当前由本 App 占用蓝牙，Agent 应处于未加载。请先在「蓝牙连接」中选中 Agent 后再启停守护进程。";
"当前目标：%@" = "当前目标：%@";
"当前系统语言暂不支持苹果原生转写。" = "当前系统语言暂不支持苹果原生转写。";
"当前订单仍未到账，请确认微信支付已完成后再刷新。" = "当前订单仍未到账，请确认微信支付已完成后再刷新。";
"当前选择由 ahakeyconfig-agent 占用蓝牙。请先在上方「蓝牙连接」切到 AhaKey Studio，或点击顶栏「设备信息 · Agent」切换。" = "当前选择由 ahakeyconfig-agent 占用蓝牙。请先在上方「蓝牙连接」切到 AhaKey Studio，或点击顶栏「设备信息 · Agent」切换。";
"录音" = "录音";
"录音中" = "录音中";
"录音结束后根据下方开关决定是否经 AhaType 整理，再写入光标。" = "录音结束后根据下方开关决定是否经 AhaType 整理，再写入光标。";
"录音转写中" = "录音转写中";
"彗星拖尾" = "彗星拖尾";
"彩色单点流水，更活跃。" = "彩色单点流水，更活跃。";
"彩虹慢波浪" = "彩虹慢波浪";
"彩虹波浪" = "彩虹波浪";
"彩虹流水" = "彩虹流水";
"待开启" = "待开启";
"微信扫码完成支付，支付成功后会自动刷新额度。" = "微信扫码完成支付，支付成功后会自动刷新额度。";
"微信语音" = "微信语音";
"快捷键" = "快捷键";
"总开关" = "总开关";
"总览" = "总览";
"恢复" = "恢复";
"恢复出厂默认键位" = "恢复出厂默认键位";
"恢复当前模式默认值" = "恢复当前模式默认值";
"恢复默认" = "恢复默认";
"成功" = "成功";
"成功扫过" = "成功扫过";
"我已完成，重新检查" = "我已完成，重新检查";
"所有特征就绪，查询设备状态" = "所有特征就绪，查询设备状态";
"手动批准" = "手动批准";
"手动批准：会交回用户/终端确认。若 Cursor、Codex 或 Kimi 仍弹窗，请看 diagnostics 里的 ide 与 diagnostic 字段。" = "手动批准：会交回用户/终端确认。若 Cursor、Codex 或 Kimi 仍弹窗，请看 diagnostics 里的 ide 与 diagnostic 字段。";
"手机号" = "手机号";
"手机号：%@" = "手机号：%@";
"打字涟漪" = "打字涟漪";
"打开主窗口" = "打开主窗口";
"打开内嵌的帮助中心" = "打开内嵌的帮助中心";
"打开系统蓝牙，用于发现、连接和同步 AhaKey 键盘。" = "打开系统蓝牙，用于发现、连接和同步 AhaKey 键盘。";
"打开系统设置" = "打开系统设置";
"打开设置" = "打开设置";
"执行失败: %@" = "执行失败: %@";
"扫描中" = "扫描中";
"扫描中…" = "扫描中…";
"扫描条" = "扫描条";
"扫描超时，继续后台轮询设备" = "扫描超时，继续后台轮询设备";
"批准" = "批准";
"批准方式" = "批准方式";
"找不到可执行脚本：%@\n\n此功能仅在从源码运行的开发构建中可用。" = "找不到可执行脚本：%@\n\n此功能仅在从源码运行的开发构建中可用。";
"拒绝" = "拒绝";
"拨杆" = "拨杆";
"拨杆 → 手动批准" = "拨杆 → 手动批准";
"拨杆 → 自动批准" = "拨杆 → 自动批准";
"拨杆切换时，自动向前台 Terminal.app / iTerm2 的 Kimi tab 发送 /yolo on/off。默认关闭。" = "拨杆切换时，自动向前台 Terminal.app / iTerm2 的 Kimi tab 发送 /yolo on/off。默认关闭。";
"拨杆在 IDE 中生效需先安装 Agent 与 Hook，并把蓝牙交给 Agent；否则仅为状态显示。" = "拨杆在 IDE 中生效需先安装 Agent 与 Hook，并把蓝牙交给 Agent；否则仅为状态显示。";
"拨杆对 Claude / Cursor / Codex / Kimi **同时生效**，与键盘当前所在 Mode 无关。Agent 后台同时监听所有 IDE 的 Hook，拨杆拨动后四个 IDE 的批准行为立即切换。" = "拨杆对 Claude / Cursor / Codex / Kimi **同时生效**，与键盘当前所在 Mode 无关。Agent 后台同时监听所有 IDE 的 Hook，拨杆拨动后四个 IDE 的批准行为立即切换。";
"拨杆已切到手动档，但当前 Kimi 会话可能仍处于 YOLO。请立即手动执行 /yolo off。" = "拨杆已切到手动档，但当前 Kimi 会话可能仍处于 YOLO。请立即手动执行 /yolo off。";
"拨杆我点了，但键盘灯效没切" = "拨杆我点了，但键盘灯效没切";
"拨杆是物理档位，不是按下瞬态。0 档显示「自动批准」，1 档显示「手动批准」。这里只读取键盘上报的位置，不模拟物理拨动。" = "拨杆是物理档位，不是按下瞬态。0 档显示「自动批准」，1 档显示「手动批准」。这里只读取键盘上报的位置，不模拟物理拨动。";
"拨杆档位" = "拨杆档位";
"按一下开始，再按一下结束" = "按一下开始，再按一下结束";
"按下" = "按下";
"按住" = "按住";
"按住录音，松手即发送" = "按住录音，松手即发送";
"按住键盘录音键不松手开始录音，松手后直接将 ASR 结果写入，响应更快。" = "按住键盘录音键不松手开始录音，松手后直接将 ASR 结果写入，响应更快。";
"按季订阅" = "按季订阅";
"按年订阅" = "按年订阅";
"按月订阅" = "按月订阅";
"按键描述" = "按键描述";
"按键映射" = "按键映射";
"按键职责" = "按键职责";
"授权步骤" = "授权步骤";
"排查请看 voice-relay.log（matched · function relay · post fn）。路径：~/Library/Application Support/AhaKeyConfig/diagnostics/" = "排查请看 voice-relay.log（matched · function relay · post fn）。路径：~/Library/Application Support/AhaKeyConfig/diagnostics/";
"探测协议" = "探测协议";
"控制方" = "控制方";
"描述" = "描述";
"提醒用户当前需要确认。" = "提醒用户当前需要确认。";
"播放速度" = "播放速度";
"播放速度 %d FPS" = "播放速度 %d FPS";
"改键、LCD、同步、本机灯效测试（macOS 暂不支持 USB 有线配置）" = "改键、LCD、同步、本机灯效测试（macOS 暂不支持 USB 有线配置）";
"数据特征(0x7341) 已订阅通知" = "数据特征(0x7341) 已订阅通知";
"整条呼吸" = "整条呼吸";
"整条均匀起伏，适合等待确认。" = "整条均匀起伏，适合等待确认。";
"整条彩色流动，更显眼。" = "整条彩色流动，更显眼。";
"文字、token、模型状态显示开发中" = "文字、token、模型状态显示开发中";
"断开" = "断开";
"新增：合盖运行" = "新增：合盖运行";
"新手引导" = "新手引导";
"新手权限已经齐了。关闭这个弹窗后，AhaKey Studio 可以连接键盘、后台监听语音键，macOS 原生语音也可以正常使用。" = "新手权限已经齐了。关闭这个弹窗后，AhaKey Studio 可以连接键盘、后台监听语音键，macOS 原生语音也可以正常使用。";
"新手权限引导" = "新手权限引导";
"新版 Kimi Code 的 dial-aware launcher 已安装到 %@。" = "新版 Kimi Code 的 dial-aware launcher 已安装到 %@。";
"无图片" = "无图片";
"无法写入 %@：%@" = "无法写入 %@：%@";
"无法写入 LaunchAgent 配置文件：%@\n\n将写入：%@\n已尝试创建目录：%@\n若仍失败，请检查对「~/Library」是否有写权限，或本机管理策略是否禁止用户 LaunchAgents。" = "无法写入 LaunchAgent 配置文件：%@\n\n将写入：%@\n已尝试创建目录：%@\n若仍失败，请检查对「~/Library」是否有写权限，或本机管理策略是否禁止用户 LaunchAgents。";
"无法写回：%@" = "无法写回：%@";
"无法创建 LCD 编码上下文。" = "无法创建 LCD 编码上下文。";
"无法创建目录 %@：%@" = "无法创建目录 %@：%@";
"无法删除 launcher %@：%@" = "无法删除 launcher %@：%@";
"无法启动修复脚本: %@" = "无法启动修复脚本: %@";
"无法启动麦克风录音。" = "无法启动麦克风录音。";
"无法安装新版 Kimi Code launcher：%@" = "无法安装新版 Kimi Code launcher：%@";
"无法恢复 %@：%@" = "无法恢复 %@：%@";
"无法获取 IOPMrootDomain" = "无法获取 IOPMrootDomain";
"无法解析 %@（非合法 JSON 或已损坏）。请用编辑器打开修正后再试，或从备份恢复。" = "无法解析 %@（非合法 JSON 或已损坏）。请用编辑器打开修正后再试，或从备份恢复。";
"无法读取 %@" = "无法读取 %@";
"无法读取 %@，请检查权限。" = "无法读取 %@，请检查权限。";
"无法读取图片文件。" = "无法读取图片文件。";
"日" = "日";
"日常使用由 Agent 控制键盘；需要改键、LCD 或同步时，进入编辑配置后由 AhaKey Studio 临时接管蓝牙。" = "日常使用由 Agent 控制键盘；需要改键、LCD 或同步时，进入编辑配置后由 AhaKey Studio 临时接管蓝牙。";
"旧版 F18 兼容" = "旧版 F18 兼容";
"是（等待对齐）" = "是（等待对齐）";
"显示在键盘 LCD 上" = "显示在键盘 LCD 上";
"显示逻辑" = "显示逻辑";
"暂无" = "暂无";
"暂无配额信息。" = "暂无配额信息。";
"更多" = "更多";
"替换成自己的图片" = "替换成自己的图片";
"最后可以直接口述一句话，确认识别和写入链路都已准备好。" = "最后可以直接口述一句话，确认识别和写入链路都已准备好。";
"最后试一次真实输入" = "最后试一次真实输入";
"最大合盖保护时长" = "最大合盖保护时长";
"最新固件 0x91 已用于灯效预览；虚拟拨杆只影响 Hook auto-approve，不再写键盘 sw_state。" = "最新固件 0x91 已用于灯效预览；虚拟拨杆只影响 Hook auto-approve，不再写键盘 sw_state。";
"最近写入：%@" = "最近写入：%@";
"最近同步 %@" = "最近同步 %@";
"最长 15 字节" = "最长 15 字节";
"月" = "月";
"有效期 %@" = "有效期 %@";
"有效期：%@" = "有效期：%@";
"有效期：无" = "有效期：无";
"服务器返回非 JSON。" = "服务器返回非 JSON。";
"未上传" = "未上传";
"未同步" = "未同步";
"未同步改动 %d" = "未同步改动 %d";
"未在 PATH 中找到 `codex` 命令，也未找到 Codex App 自带 CLI：%@。Hook 配置已安装；若需在终端使用 Codex，请先安装或更新 Codex 客户端。" = "未在 PATH 中找到 `codex` 命令，也未找到 Codex App 自带 CLI：%@。Hook 配置已安装；若需在终端使用 Codex，请先安装或更新 Codex 客户端。";
"未安装 LaunchAgent，无法将蓝牙交给 Agent，临时允许 App 连接" = "未安装 LaunchAgent，无法将蓝牙交给 Agent，临时允许 App 连接";
"未就绪" = "未就绪";
"未开启" = "未开启";
"未找到 %@，无需移除 Codex Hooks。" = "未找到 %@，无需移除 Codex Hooks。";
"未找到 %@，无需移除 Kimi Hooks。" = "未找到 %@，无需移除 Kimi Hooks。";
"未找到用户级 %@。\n\n若你只在**项目**里合并过 `.cursor/hooks.json`，需在该项目根目录中手动编辑或删除 AhaKey 相关条目，用户级里本来就没有可卸内容。" = "未找到用户级 %@。\n\n若你只在**项目**里合并过 `.cursor/hooks.json`，需在该项目根目录中手动编辑或删除 AhaKey 相关条目，用户级里本来就没有可卸内容。";
"未授权" = "未授权";
"未激活" = "未激活";
"未生效" = "未生效";
"未知" = "未知";
"未装 Agent" = "未装 Agent";
"未设置" = "未设置";
"未设置（用键盘真实值）" = "未设置（用键盘真实值）";
"未识别到内容" = "未识别到内容";
"未识别到有效语音内容。" = "未识别到有效语音内容。";
"未运行" = "未运行";
"未连接" = "未连接";
"未配置语音软件。" = "未配置语音软件。";
"本 App 主动连接键盘。" = "本 App 主动连接键盘。";
"本 App 已连接蓝牙" = "本 App 已连接蓝牙";
"本 App 未连接" = "本 App 未连接";
"本 App 连接蓝牙，用于配置与同步。Agent 的 LaunchJob 在持有方为 App 时不会加载，避免抢连接。" = "本 App 连接蓝牙，用于配置与同步。Agent 的 LaunchJob 在持有方为 App 时不会加载，避免抢连接。";
"本地识别中" = "本地识别中";
"权限清单" = "权限清单";
"权限诊断" = "权限诊断";
"权限诊断弹窗里。可以不连键盘就验证 macOS 原生转写是否能识别。如果转写失败，多半是麦克风权限或没装语言模型（系统设置 → Siri 与听写 → 听写语言）。" = "权限诊断弹窗里。可以不连键盘就验证 macOS 原生转写是否能识别。如果转写失败，多半是麦克风权限或没装语言模型（系统设置 → Siri 与听写 → 听写语言）。";
"来回流水" = "来回流水";
"松开" = "松开";
"查看日志" = "查看日志";
"查看设置" = "查看设置";
"查看语音权限状态与诊断日志" = "查看语音权限状态与诊断日志";
"查询状态" = "查询状态";
"查询订单状态失败" = "查询订单状态失败";
"查询设备状态…" = "查询设备状态…";
"检测到应用签名变化" = "检测到应用签名变化";
"检测到终端中 `codex` 不可用，但无法创建 %@：%@。Hook 配置已安装。" = "检测到终端中 `codex` 不可用，但无法创建 %@：%@。Hook 配置已安装。";
"检测目标" = "检测目标";
"模拟按一次语音键" = "模拟按一次语音键";
"橙色快速闪烁，适合警告。" = "橙色快速闪烁，适合警告。";
"欢迎" = "欢迎";
"正在上传 %@ 的 LCD 图片…" = "正在上传 %@ 的 LCD 图片…";
"正在上传图片到 %@…" = "正在上传图片到 %@…";
"正在停止当前图片写入；已完成的图片会保留…" = "正在停止当前图片写入；已完成的图片会保留…";
"正在兑换免费券…" = "正在兑换免费券…";
"正在写入 %@…" = "正在写入 %@…";
"正在写入当前光标" = "正在写入当前光标";
"正在写入灯效与键位配置（约 %d 条）…" = "正在写入灯效与键位配置（约 %d 条）…";
"正在准备写入设备…" = "正在准备写入设备…";
"正在创建微信支付订单…" = "正在创建微信支付订单…";
"正在刷新用户信息…" = "正在刷新用户信息…";
"正在取消…" = "正在取消…";
"正在恢复键盘控制，Agent 正在连接键盘…" = "正在恢复键盘控制，Agent 正在连接键盘…";
"正在整理语音文本" = "正在整理语音文本";
"正在查询订单状态…" = "正在查询订单状态…";
"正在检查系统权限…" = "正在检查系统权限…";
"正在检查麦克风与语音转写权限…" = "正在检查麦克风与语音转写权限…";
"正在结束录音并整理文字…" = "正在结束录音并整理文字…";
"正在请求云端账号…" = "正在请求云端账号…";
"正在预览灯光强度：%d%% 。" = "正在预览灯光强度：%d%% 。";
"正在预览灯效：%@。" = "正在预览灯效：%@。";
"步骤（依次执行）" = "步骤（依次执行）";
"每周" = "每周";
"每日" = "每日";
"每月" = "每月";
"比普通彩虹波浪更慢，适合做氛围效果。" = "比普通彩虹波浪更慢，适合做氛围效果。";
"没有可上传的图片帧。" = "没有可上传的图片帧。";
"没有可编码的图片帧。" = "没有可编码的图片帧。";
"没有未同步改动，直接把蓝牙交还给 Agent。" = "没有未同步改动，直接把蓝牙交还给 Agent。";
"注册" = "注册";
"注册失败。" = "注册失败。";
"注册成功。" = "注册成功。";
"注册登录" = "注册登录";
"添加 GIF" = "添加 GIF";
"添加图片" = "添加图片";
"添加步骤" = "添加步骤";
"清空" = "清空";
"清空剪贴板" = "清空剪贴板";
"清除 %@ %@ 宏层（将写入快捷键）" = "清除 %@ %@ 宏层（将写入快捷键）";
"清除 %@ %@ 快捷键" = "清除 %@ %@ 快捷键";
"清除 %@ %@ 快捷键层（将写入宏）" = "清除 %@ %@ 快捷键层（将写入宏）";
"清除修饰键" = "清除修饰键";
"灯光" = "灯光";
"灯效映射 %@" = "灯效映射 %@";
"灯条" = "灯条";
"灯条、LCD 屏幕、Key1（语音）、Key2、Key3、Key4、拨杆。点哪个就在右侧 Inspector 看到那个元件的配置。" = "灯条、LCD 屏幕、Key1（语音）、Key2、Key3、Key4、拨杆。点哪个就在右侧 Inspector 看到那个元件的配置。";
"灯条颜色" = "灯条颜色";
"点亮键盘顶端 8 颗 WS2812 LED；颜色和效果跟随 IDE Hook 状态。" = "点亮键盘顶端 8 颗 WS2812 LED；颜色和效果跟随 IDE Hook 状态。";
"点击切换 Mode（模拟实体键）" = "点击切换 Mode（模拟实体键）";
"点击按钮发送对应状态到键盘，观察 LED 变化。" = "点击按钮发送对应状态到键盘，观察 LED 变化。";
"点击状态会在虚拟键盘预览，并通过 0x91 临时预览到设备；保存请使用底部通用按钮。" = "点击状态会在虚拟键盘预览，并通过 0x91 临时预览到设备；保存请使用底部通用按钮。";
"点底栏的「权限诊断」按钮打开（不是这里的页面）" = "点底栏的「权限诊断」按钮打开（不是这里的页面）";
"点按灯条、屏幕、四个按键或拨杆即可进入对应配置。" = "点按灯条、屏幕、四个按键或拨杆即可进入对应配置。";
"点画布拨杆触发三件事（不是所有都生效）：" = "点画布拨杆触发三件事（不是所有都生效）：";
"熄灭" = "熄灭";
"物理拨杆坏了？或想软件控制？看这里" = "物理拨杆坏了？或想软件控制？看这里";
"特征" = "特征";
"状态反馈" = "状态反馈";
"状态灯效映射" = "状态灯效映射";
"状态行" = "状态行";
"状态资源：固件按 Hook 状态自动切换工作中、等待授权、已完成。" = "状态资源：固件按 Hook 状态自动切换工作中、等待授权、已完成。";
"状态预览" = "状态预览";
"状态：%@" = "状态：%@";
"现在申请权限" = "现在申请权限";
"现在键盘 flash 各 Mode 状态" = "现在键盘 flash 各 Mode 状态";
"现状一览" = "现状一览";
"琥珀色呼吸 + 中心闪烁，等待用户操作。" = "琥珀色呼吸 + 中心闪烁，等待用户操作。";
"用户主动断开" = "用户主动断开";
"用户信息已刷新。" = "用户信息已刷新。";
"用户提交" = "用户提交";
"用户请求：合盖保护" = "用户请求：合盖保护";
"用户请求：阻止空闲休眠" = "用户请求：阻止空闲休眠";
"申请" = "申请";
"电池特征(0x2A19) 读取中" = "电池特征(0x2A19) 读取中";
"电量" = "电量";
"电量过低，已完全释放合盖运行" = "电量过低，已完全释放合盖运行";
"画布上灯条不变色" = "画布上灯条不变色";
"画布与按键" = "画布与按键";
"画布预览：%@" = "画布预览：%@";
"登录" = "登录";
"登录后可使用 AhaType 云端大模型整理。" = "登录后可使用 AhaType 云端大模型整理。";
"登录后可启用 AhaType 云端整理。" = "登录后可启用 AhaType 云端整理。";
"登录失败。" = "登录失败。";
"登录成功。" = "登录成功。";
"直接按下键盘快捷键即可" = "直接按下键盘快捷键即可";
"直接按键设置主键，点击箭头展开下拉列表。" = "直接按键设置主键，点击箭头展开下拉列表。";
"直接自己指定底层快捷键。" = "直接自己指定底层快捷键。";
"知道了" = "知道了";
"短按" = "短按";
"短按 + 长按" = "短按 + 长按";
"短按 vs 长按" = "短按 vs 长按";
"硬件物理键码 + 软件配置同步切换" = "硬件物理键码 + 软件配置同步切换";
"硬性限制：源文件 ≤ 2 MB，FPS 1–30，单模式最多 70 帧；Mode 1/2/3/4 固定写入 slot 10/80/150/220。" = "硬性限制：源文件 ≤ 2 MB，FPS 1–30，单模式最多 70 帧；Mode 1/2/3/4 固定写入 slot 10/80/150/220。";
"确定" = "确定";
"确认恢复" = "确认恢复";
"确认键" = "确认键";
"移除 Claude Hooks" = "移除 Claude Hooks";
"移除 Codex Hooks" = "移除 Codex Hooks";
"移除 Cursor Hooks" = "移除 Cursor Hooks";
"移除 Kimi Hooks" = "移除 Kimi Hooks";
"稍后再说" = "稍后再说";
"稍后再退" = "稍后再退";
"空" = "空";
"空宏。点下方「添加步骤」开始录制。" = "空宏。点下方「添加步骤」开始录制。";
"空操作" = "空操作";
"空白" = "空白";
"立即恢复正常休眠" = "立即恢复正常休眠";
"立即翻转画布拨杆位置 + 顶部状态栏；视觉零延迟" = "立即翻转画布拨杆位置 + 顶部状态栏；视觉零延迟";
"立即退出 App" = "立即退出 App";
"立即重启" = "立即重启";
"第一步：弹窗确认授权" = "第一步：弹窗确认授权";
"第三步：体验输入" = "第三步：体验输入";
"第二步：系统设置授权" = "第二步：系统设置授权";
"等待审批" = "等待审批";
"等待批准" = "等待批准";
"等待授权" = "等待授权";
"等待支付超时，可稍后刷新用户信息确认到账。" = "等待支付超时，可稍后刷新用户信息确认到账。";
"等待权限" = "等待权限";
"等待系统权限" = "等待系统权限";
"等待自定义" = "等待自定义";
"等待苹果原生转写就绪。" = "等待苹果原生转写就绪。";
"等待触发" = "等待触发";
"等待设备" = "等待设备";
"等待设备响应超时: 0x%02X" = "等待设备响应超时: 0x%02X";
"等待语音路由初始化。" = "等待语音路由初始化。";
"简体中文" = "简体中文";
"类型" = "类型";
"系统设置" = "系统设置";
"系统设置授权" = "系统设置授权";
"红色慢闪，表示低电量。" = "红色慢闪，表示低电量。";
"绑定" = "绑定";
"结束并写入" = "结束并写入";
"继续编辑" = "继续编辑";
"绿色从左到右逐渐点亮。" = "绿色从左到右逐渐点亮。";
"绿色填充流动，表示充电中。" = "绿色填充流动，表示充电中。";
"编程中" = "编程中";
"编程合盖保护" = "编程合盖保护";
"编程时阻止系统休眠" = "编程时阻止系统休眠";
"编辑配置" = "编辑配置";
"编辑配置中" = "编辑配置中";
"脚本执行失败 (exit=%d)\n\n%@" = "脚本执行失败 (exit=%d)\n\n%@";
"自动批准" = "自动批准";
"自动批准依赖 Agent 与 Hook，且须蓝牙由 Agent 占用" = "自动批准依赖 Agent 与 Hook，且须蓝牙由 Agent 占用";
"自动批准：**Claude / Codex PermissionRequest**，**Cursor preToolUse**（含 cli-config）。**Kimi**：安装过 AhaKey Kimi Hooks 后，拨杆会直接接管**当前会话**的自动批准；刚装完或刚升级 kimi-cli 时，重开一次 kimi 即可。" = "自动批准：**Claude / Codex PermissionRequest**，**Cursor preToolUse**（含 cli-config）。**Kimi**：安装过 AhaKey Kimi Hooks 后，拨杆会直接接管**当前会话**的自动批准；刚装完或刚升级 kimi-cli 时，重开一次 kimi 即可。";
"自定义快捷键" = "自定义快捷键";
"自定义模式。" = "自定义模式。";
"自定义模式：可自由配置所有按键和灯效。" = "自定义模式：可自由配置所有按键和灯效。";
"若仍出现手动：在「设备信息」里打开「工具批准诊断」查看 permission-request.log（含 ide、hookEvent、diagnostic 等）。" = "若仍出现手动：在「设备信息」里打开「工具批准诊断」查看 permission-request.log（含 ide、hookEvent、diagnostic 等）。";
"若系统里已勾选允许，本应用仍显示未开启：请完全退出 AhaKey Studio 并再启动一次。输入监控、辅助功能等常按进程生效，只点「重新检查」或从后台切回，有时读到的仍是旧状态，重启后即可与系统设置一致。" = "若系统里已勾选允许，本应用仍显示未开启：请完全退出 AhaKey Studio 并再启动一次。输入监控、辅助功能等常按进程生效，只点「重新检查」或从后台切回，有时读到的仍是旧状态，重启后即可与系统设置一致。";
"若需与「⌘↵ 接受 / ⌘⌫ 拒绝」等组合键一致，请在编辑器里为对应键加修饰，并在 Cursor 设置 → Keyboard Shortcuts 中绑成相同组合。" = "若需与「⌘↵ 接受 / ⌘⌫ 拒绝」等组合键一致，请在编辑器里为对应键加修饰，并在 Cursor 设置 → Keyboard Shortcuts 中绑成相同组合。";
"苹果原生转写" = "苹果原生转写";
"苹果原生转写失败：%@" = "苹果原生转写失败：%@";
"苹果原生转写已就绪，按一次语音键开始，再按一次结束。" = "苹果原生转写已就绪，按一次语音键开始，再按一次结束。";
"苹果原生转写录音中… 再按一次语音键结束。" = "苹果原生转写录音中… 再按一次语音键结束。";
"获取用户信息失败" = "获取用户信息失败";
"蓝牙" = "蓝牙";
"蓝牙、麦克风和语音转写可以直接弹窗确认，点击「申请」后在弹窗中允许即可。" = "蓝牙、麦克风和语音转写可以直接弹窗确认，点击「申请」后在弹窗中允许即可。";
"蓝牙关闭" = "蓝牙关闭";
"蓝牙可用，可以扫描并连接键盘。" = "蓝牙可用，可以扫描并连接键盘。";
"蓝牙就绪" = "蓝牙就绪";
"蓝牙已关闭" = "蓝牙已关闭";
"蓝牙已开启" = "蓝牙已开启";
"蓝牙权限未开启" = "蓝牙权限未开启";
"蓝牙连接" = "蓝牙连接";
"蓝色呼吸波浪，适合思考中。" = "蓝色呼吸波浪，适合思考中。";
"蓝色思考" = "蓝色思考";
"虚拟拨杆" = "虚拟拨杆";
"虚拟拨杆 → 手动批准（hook 交回终端确认）" = "虚拟拨杆 → 手动批准（hook 交回终端确认）";
"虚拟拨杆 → 自动批准（hook 自动放行；灯效若不变需先刷支持 0x91 的固件）" = "虚拟拨杆 → 自动批准（hook 自动放行；灯效若不变需先刷支持 0x91 的固件）";
"虚拟拨杆不再占用 0x91，避免与最新固件的灯效预览命令冲突。" = "虚拟拨杆不再占用 0x91，避免与最新固件的灯效预览命令冲突。";
"表示本轮执行已经完成。" = "表示本轮执行已经完成。";
"规划中，保留入口。" = "规划中，保留入口。";
"触发方式" = "触发方式";
"触发阈值" = "触发阈值";
"警告闪烁" = "警告闪烁";
"订单尚未到账，请稍后再刷新。" = "订单尚未到账，请稍后再刷新。";
"订单已创建，请使用微信扫码支付。" = "订单已创建，请使用微信扫码支付。";
"订单已标记为失败，请重新发起充值。" = "订单已标记为失败，请重新发起充值。";
"订单支付失败。" = "订单支付失败。";
"订单状态查询失败。" = "订单状态查询失败。";
"订单：%@" = "订单：%@";
"记住密码" = "记住密码";
"设备 LCD 只稳定支持 ASCII。中文、emoji 和全角字符会在写入时被自动过滤，避免乱码。" = "设备 LCD 只稳定支持 ASCII。中文、emoji 和全角字符会在写入时被自动过滤，避免乱码。";
"设备信息" = "设备信息";
"设备信息 · Agent" = "设备信息 · Agent";
"设备信息 · Agent…" = "设备信息 · Agent…";
"设备信息(0x7342) 就绪" = "设备信息(0x7342) 就绪";
"设备信息（蓝牙 / 启停 Agent）…" = "设备信息（蓝牙 / 启停 Agent）…";
"设备名" = "设备名";
"设备实际写入：%@" = "设备实际写入：%@";
"设备拒绝了命令 0x%02X，状态码 0x%02X" = "设备拒绝了命令 0x%02X，状态码 0x%02X";
"设备未连接或命令通道未就绪，当前只保存本地草稿。" = "设备未连接或命令通道未就绪，当前只保存本地草稿。";
"设备未连接，请先连接键盘后重试。" = "设备未连接，请先连接键盘后重试。";
"设备没有保存对应状态的任务动画槽位信息；请更新到支持任务图的固件后重试。" = "设备没有保存对应状态的任务动画槽位信息；请更新到支持任务图的固件后重试。";
"设备状态查询" = "设备状态查询";
"设备该槽为空" = "设备该槽为空";
"设备返回的任务动画槽位信息无法解析；请确认键盘已烧录任务 GIF 固件。" = "设备返回的任务动画槽位信息无法解析；请确认键盘已烧录任务 GIF 固件。";
"设备返回的动画槽位信息无法解析。" = "设备返回的动画槽位信息无法解析。";
"设备连接中，连接成功后将自动同步并返回控制模式…" = "设备连接中，连接成功后将自动同步并返回控制模式…";
"设置路线" = "设置路线";
"识别失败" = "识别失败";
"识别完成，但写入当前光标失败。" = "识别完成，但写入当前光标失败。";
"诊断日志" = "诊断日志";
"语言 / Language" = "语言 / Language";
"语言更改将在下次启动 AhaKey Studio 后生效。" = "语言更改将在下次启动 AhaKey Studio 后生效。";
"语音" = "语音";
"语音已准备" = "语音已准备";
"语音文本已完成" = "语音文本已完成";
"语音桥" = "语音桥";
"语音结果直接粘贴" = "语音结果直接粘贴";
"语音识别权限已被拒绝" = "语音识别权限已被拒绝";
"语音转写" = "语音转写";
"语音输入" = "语音输入";
"语音输入方式" = "语音输入方式";
"语音键" = "语音键";
"语音键后台监听准备中。关闭窗口后，AhaKey Studio 也会继续驻留后台。" = "语音键后台监听准备中。关闭窗口后，AhaKey Studio 也会继续驻留后台。";
"语音键的输入方式独立于当前 Mode，在任意 Mode 下都可使用相同的语音输入设置。" = "语音键的输入方式独立于当前 Mode，在任意 Mode 下都可使用相同的语音输入设置。";
"语音键预设会固定使用单键绑定；如需录制宏，请先把预设改为自定义快捷键。" = "语音键预设会固定使用单键绑定；如需录制宏，请先把预设改为自定义快捷键。";
"请依次开启 Siri、听写、辅助功能，最后开启输入监控。输入监控设置后通常需要退出并重新打开，本引导会记住进度。" = "请依次开启 Siri、听写、辅助功能，最后开启输入监控。输入监控设置后通常需要退出并重新打开，本引导会记住进度。";
"请先注册登录 AhaType 后再开启云端整理。" = "请先注册登录 AhaType 后再开启云端整理。";
"请先登录后再充值。" = "请先登录后再充值。";
"请先连接 AhaKey 设备" = "请先连接 AhaKey 设备";
"请检查输入权限" = "请检查输入权限";
"请求失败（HTTP %d）。" = "请求失败（HTTP %d）。";
"请点「查看日志」检查 %@；并确认系统「隐私与安全性」中已允许本应用使用蓝牙；若通过 LaunchAgent 拉起 agent 子进程，也需为同一签名的二进制授权。" = "请点「查看日志」检查 %@；并确认系统「隐私与安全性」中已允许本应用使用蓝牙；若通过 LaunchAgent 拉起 agent 子进程，也需为同一签名的二进制授权。";
"请直接拨动键盘上的物理拨杆切换；`/yolo` 不会覆盖拨杆。" = "请直接拨动键盘上的物理拨杆切换；`/yolo` 不会覆盖拨杆。";
"请确认 LaunchAgent 里 ahakeyconfig-agent 在跑、且蓝牙已选「由 Agent 占用」并连上键盘。\n" = "请确认 LaunchAgent 里 ahakeyconfig-agent 在跑、且蓝牙已选「由 Agent 占用」并连上键盘。\n";
"请蓝牙连接小键盘后，将光标放在这里，按下麦克风键开始说话" = "请蓝牙连接小键盘后，将光标放在这里，按下麦克风键开始说话";
"请蓝牙连接小键盘后，将光标放在这里，按下麦克风键开始说话。" = "请蓝牙连接小键盘后，将光标放在这里，按下麦克风键开始说话。";
"请输入兑换码。" = "请输入兑换码。";
"请输入手机号和密码。" = "请输入手机号和密码。";
"请输入账号密码重新登录。" = "请输入账号密码重新登录。";
"请重试或检查语音权限" = "请重试或检查语音权限";
"请靠近麦克风重试" = "请靠近麦克风重试";
"读配置 0x01" = "读配置 0x01";
"读配置 0x03" = "读配置 0x03";
"读配置 0x05" = "读配置 0x05";
"调用苹果原生语音转写，识别完成后以 ⌘V 写回当前光标位置。适合 Claude Code、Kimi Code、Codex 等 CLI 终端及任意输入框。按一次开始，再按一次结束。" = "调用苹果原生语音转写，识别完成后以 ⌘V 写回当前光标位置。适合 Claude Code、Kimi Code、Codex 等 CLI 终端及任意输入框。按一次开始，再按一次结束。";
"豆包输入法" = "豆包输入法";
"豆包输入法 Mac 版需要直接接收真实语音键事件。AhaKey Studio 会切到豆包输入源，并把 F18 配置为豆包长按语音快捷键；按住语音键说话，松开后由豆包提交文字。" = "豆包输入法 Mac 版需要直接接收真实语音键事件。AhaKey Studio 会切到豆包输入源，并把 F18 配置为豆包长按语音快捷键；按住语音键说话，松开后由豆包提交文字。";
"豆包需要真实 F18 长按事件；已切到豆包输入源并配置长按 F18，请用实体语音键测试。" = "豆包需要真实 F18 长按事件；已切到豆包输入源并配置长按 F18，请用实体语音键测试。";
"账号请求失败。" = "账号请求失败。";
"超过固件单键宏 98 字节 / 49 步上限，同步时会被拒绝。" = "超过固件单键宏 98 字节 / 49 步上限，同步时会被拒绝。";
"跳过" = "跳过";
"转写权限" = "转写权限";
"转写测试" = "转写测试";
"转写测试在哪" = "转写测试在哪";
"软件覆盖拨杆" = "软件覆盖拨杆";
"辅助功能" = "辅助功能";
"输入方式" = "输入方式";
"输入监控" = "输入监控";
"输入监控 %@ · 辅助功能 %@ · 检查于 %@" = "输入监控 %@ · 辅助功能 %@ · 检查于 %@";
"达到最大合盖保护时长，已自动释放 L3" = "达到最大合盖保护时长，已自动释放 L3";
"运行中" = "运行中";
"返回" = "返回";
"还没有选择图片" = "还没有选择图片";
"还缺%@权限。请先在系统设置里打开后，再按一次语音键。" = "还缺%@权限。请先在系统设置里打开后，再按一次语音键。";
"还缺系统权限：请为 AhaKey Studio 打开“输入监控”和“辅助功能”，授权后回到软件点“重新检查权限”。" = "还缺系统权限：请为 AhaKey Studio 打开“输入监控”和“辅助功能”，授权后回到软件点“重新检查权限”。";
"还缺苹果原生语音权限，请先打开麦克风、语音转写、Siri 与听写。" = "还缺苹果原生语音权限，请先打开麦克风、语音转写、Siri 与听写。";
"这会立即释放所有合盖运行断言和虚拟显示器。" = "这会立即释放所有合盖运行断言和虚拟显示器。";
"这里会显示实时识别或最近写入的内容。" = "这里会显示实时识别或最近写入的内容。";
"这里使用软件内同一套语音链路测试，不再只是展示授权状态。" = "这里使用软件内同一套语音链路测试，不再只是展示授权状态。";
"这里展示的是你刚选中的图片文件。" = "这里展示的是你刚选中的图片文件。";
"进入工作台" = "进入工作台";
"连接" = "连接";
"连接与控制" = "连接与控制";
"连接中…" = "连接中…";
"连接失败" = "连接失败";
"连接设备" = "连接设备";
"连接超时，本次未写入键盘；已释放蓝牙给 Agent，可再次进入编辑后重试保存。" = "连接超时，本次未写入键盘；已释放蓝牙给 Agent，可再次进入编辑后重试保存。";
"退出 AhaKey Studio" = "退出 AhaKey Studio";
"退出并重新打开" = "退出并重新打开";
"退出并重新打开…" = "退出并重新打开…";
"退出登录" = "退出登录";
"适合批准、确认、继续执行这类高频动作。" = "适合批准、确认、继续执行这类高频动作。";
"适合拒绝、取消、停止这类相反动作。" = "适合拒绝、取消、停止这类相反动作。";
"选择 GIF 或图片" = "选择 GIF 或图片";
"选择图片" = "选择图片";
"通信日志" = "通信日志";
"通知" = "通知";
"通知 Agent 设置 userSwitchOverride" = "通知 Agent 设置 userSwitchOverride";
"通知特征(0x7344) 已订阅" = "通知特征(0x7344) 已订阅";
"通知通道已订阅" = "通知通道已订阅";
"部分完成：键位与灯效已写入，但有 %d 张图片未写入（%@）。其余图片不受影响，可再次点击写入仅重试这些图片。" = "部分完成：键位与灯效已写入，但有 %d 张图片未写入（%@）。其余图片不受影响，可再次点击写入仅重试这些图片。";
"配置层仅影响新启动的 Kimi 会话；已运行会话请用 /yolo on/off 切换，或关闭后重新启动。PreToolUse 仍仅 deny 会拦工具。" = "配置层仅影响新启动的 Kimi 会话；已运行会话请用 /yolo on/off 切换，或关闭后重新启动。PreToolUse 仍仅 deny 会拦工具。";
"配置已成功写入键盘。" = "配置已成功写入键盘。";
"重新打开 AhaKey Studio 新手引导" = "重新打开 AhaKey Studio 新手引导";
"重新检查" = "重新检查";
"重新检查权限" = "重新检查权限";
"重新连接设备" = "重新连接设备";
"重置中…" = "重置中…";
"重置失败:\n普通模式: %@\nsudo模式: %@" = "重置失败:\n普通模式: %@\nsudo模式: %@";
"重置并授权" = "重置并授权";
"重置并重启" = "重置并重启";
"针对 Claude Code 终端权限菜单：Key2 直接输入 Y（同意），Key3 直接输入 N（拒绝）。" = "针对 Claude Code 终端权限菜单：Key2 直接输入 Y（同意），Key3 直接输入 N（拒绝）。";
"针对 Codex 终端审批：Key2 发送 ↵ 确认，Key3 发送 Esc 取消。" = "针对 Codex 终端审批：Key2 发送 ↵ 确认，Key3 发送 Esc 取消。";
"针对 Cursor Composer / Agent：Key2 发 ↵、Key3 发 ⌫（与裸键一致）。" = "针对 Cursor Composer / Agent：Key2 发 ↵、Key3 发 ⌫（与裸键一致）。";
"键位/灯效已保存；有 %d 张图片未写入：%@。其余图片不受影响，可再次点击写入仅重试这些图片。" = "键位/灯效已保存；有 %d 张图片未写入：%@。其余图片不受影响，可再次点击写入仅重试这些图片。";
"键盘已连接" = "键盘已连接";
"键盘已连接；正在同步 Agent 连接状态" = "键盘已连接；正在同步 Agent 连接状态";
"键盘控制中" = "键盘控制中";
"键盘连接已中断，当前图片写入已停止。请重连后继续。" = "键盘连接已中断，当前图片写入已停止。请重连后继续。";
"键码" = "键码";
"长按" = "长按";
"长按绑定不同快捷键需固件升级后生效，当前仅短按绑定会写入设备。" = "长按绑定不同快捷键需固件升级后生效，当前仅短按绑定会写入设备。";
"防止电脑进入睡眠" = "防止电脑进入睡眠";
"阻止空闲休眠" = "阻止空闲休眠";
"需 macOS 14 或更高版本" = "需 macOS 14 或更高版本";
"需固件支持" = "需固件支持";
"需清除" = "需清除";
"需要先安装 Agent" = "需要先安装 Agent";
"需要固件 v2+ 支持" = "需要固件 v2+ 支持";
"需要安装 Agent 后才能控制键盘" = "需要安装 Agent 后才能控制键盘";
"需要重启" = "需要重启";
"需要重启以刷新权限" = "需要重启以刷新权限";
"需要重置语音识别权限才能继续。点击「重置」后需重启应用才能重新授权。" = "需要重置语音识别权限才能继续。点击「重置」后需重启应用才能重新授权。";
"需要重置麦克风权限才能重新授权。" = "需要重置麦克风权限才能重新授权。";
"预览到键盘" = "预览到键盘";
"预览动图" = "预览动图";
"预览图片" = "预览图片";
"预览：%@" = "预览：%@";
"预设对应快捷键：Typeless/微信语音/豆包输入法内仍选 Fn/Globe。本 Studio 使用 F19 作为 Fn 触发键；按下后向系统注入「按住 Fn」。旧版 F18 仍会兼容监听。请授予输入监控与辅助功能。" = "预设对应快捷键：Typeless/微信语音/豆包输入法内仍选 Fn/Globe。本 Studio 使用 F19 作为 Fn 触发键；按下后向系统注入「按住 Fn」。旧版 F18 仍会兼容监听。请授予输入监控与辅助功能。";
"预设方案" = "预设方案";
"颜色对照表" = "颜色对照表";
"首次连接，可以先打开「权限诊断」过一遍权限项；任何 Hook 不生效的问题大多在权限里。" = "首次连接，可以先打开「权限诊断」过一遍权限项；任何 Hook 不生效的问题大多在权限里。";
"麦克风" = "麦克风";
"麦克风 %@ · 语音转写 %@ · Siri %@ · 听写 %@ · 检查于 %@" = "麦克风 %@ · 语音转写 %@ · Siri %@ · 听写 %@ · 检查于 %@";
"麦克风 + 输入监控 + 辅助功能三个权限都得给。打开「权限诊断」可以一键跳到系统设置对应页。" = "麦克风 + 输入监控 + 辅助功能三个权限都得给。打开「权限诊断」可以一键跳到系统设置对应页。";
"麦克风权限已自动重置，下次点击「申请」按钮时会弹出系统授权对话框。" = "麦克风权限已自动重置，下次点击「申请」按钮时会弹出系统授权对话框。";
"麦克风权限已被拒绝" = "麦克风权限已被拒绝";
"麦克风权限已重置" = "麦克风权限已重置";
"麦克风权限已重置（使用 sudo）" = "麦克风权限已重置（使用 sudo）";
"默认 Backspace，可改任意短按 / 长按。" = "默认 Backspace，可改任意短按 / 长按。";
"默认动图" = "默认动图";
"默认图片" = "默认图片";
"默认图片（连接即自动同步）" = "默认图片（连接即自动同步）";
"默认效果是来回流水灯。" = "默认效果是来回流水灯。";
"默认用红色常亮停住。" = "默认用红色常亮停住。";
"（AhaType 总开关已关闭）" = "（AhaType 总开关已关闭）";
"（switchState 缺省：批准链可能仍交回手动；请把「蓝牙」交给 Agent 并连上键盘。）" = "（switchState 缺省：批准链可能仍交回手动；请把「蓝牙」交给 Agent 并连上键盘。）";
"（存在但无法解析为 JSON：%@）" = "（存在但无法解析为 JSON：%@）";
"（存在但无法读取：%@）" = "（存在但无法读取：%@）";
"（拨杆非 0：PermissionRequest 将交回终端手动确认）" = "（拨杆非 0：PermissionRequest 将交回终端手动确认）";
"（文件不存在：%@）\n\n可先点「安装 Codex Hooks」创建并合并 `[features].hooks` 与 AhaKey hook block。" = "（文件不存在：%@）\n\n可先点「安装 Codex Hooks」创建并合并 `[features].hooks` 与 AhaKey hook block。";
"（文件不存在：%@）\n\n可先点「安装 Cursor Hooks」生成或合并；若只使用**项目内** `.cursor/hooks.json`，本路径仍可能为空。" = "（文件不存在：%@）\n\n可先点「安装 Cursor Hooks」生成或合并；若只使用**项目内** `.cursor/hooks.json`，本路径仍可能为空。";
"（文件不存在：%@）\n\n可先点「安装 Kimi Hooks」创建并写入 AhaKey 标记块；须已安装并使用 Kimi Code CLI：https://moonshotai.github.io/kimi-cli/" = "（文件不存在：%@）\n\n可先点「安装 Kimi Hooks」创建并写入 AhaKey 标记块；须已安装并使用 Kimi Code CLI：https://moonshotai.github.io/kimi-cli/";
"（文件不存在：%@）\n\n可点诊断面板中「合并 Shell 白名单 + approvalMode=auto」从空白创建；或自行在文档中按 `permissions` 配置。" = "（文件不存在：%@）\n\n可点诊断面板中「合并 Shell 白名单 + approvalMode=auto」从空白创建；或自行在文档中按 `permissions` 配置。";
"（无输出）" = "（无输出）";
"（无输出，退出非 0）" = "（无输出，退出非 0）";
"余额" = "余额";
"登录已过期，请重新登录。" = "登录已过期，请重新登录。";
"云端返回的用户信息缺少可识别字段。" = "云端返回的用户信息缺少可识别字段。";
"配额拉取失败，请打开云端账号手动刷新。" = "配额拉取失败，请打开云端账号手动刷新。";
"剩余额度" = "剩余额度";
"编辑器占用蓝牙 · Agent 空闲" = "编辑器占用蓝牙 · Agent 空闲";
"编辑器空闲 · Agent 占用蓝牙" = "编辑器空闲 · Agent 占用蓝牙";
"编辑器空闲 · Agent 空闲（未连接键盘）" = "编辑器空闲 · Agent 空闲（未连接键盘）";
"双击键盘电源键可切换当前模式的整套状态图；也可在上方选择写入后的激活套图。" = "双击键盘电源键可切换当前模式的整套状态图；也可在上方选择写入后的激活套图。";
"图片帧编码尺寸无效；每帧必须是 160×80 RGB565。" = "图片帧编码尺寸无效；每帧必须是 160×80 RGB565。";
"基础配置已写入；任务图未写入，因为当前固件协议无法识别。" = "基础配置已写入；任务图未写入，因为当前固件协议无法识别。";
"套图 A" = "套图 A";
"套图 B" = "套图 B";
"已更新 %@ 套图 %@ 的 %@ 预览；写入设备请使用底部通用按钮。" = "已更新 %@ 套图 %@ 的 %@ 预览；写入设备请使用底部通用按钮。";
"已清空套图 %@ · %@，写入设备后生效。" = "已清空套图 %@ · %@，写入设备后生效。";
"已识别新固件出厂图片；本地图片草稿保持不变。" = "已识别新固件出厂图片；本地图片草稿保持不变。";
"已选 %d 帧图片：套图 %@ · %@。" = "已选 %d 帧图片：套图 %@ · %@。";
"当前固件协议不支持这项任务图操作。" = "当前固件协议不支持这项任务图操作。";
"当前固件协议无法识别，任务状态图配置已停用；键位和灯效仍可使用。" = "当前固件协议无法识别，任务状态图配置已停用；键位和灯效仍可使用。";
"待机" = "待机";
"旧版数据迁移(schema<3)" = "旧版数据迁移(schema<3)";
"检测到固件出厂图片已更新；本地自定义图片已标记为待写入。" = "检测到固件出厂图片已更新；本地自定义图片已标记为待写入。";
"槽位与默认动画重叠迁移" = "槽位与默认动画重叠迁移";
"状态资源：固件按 Hook 状态自动切换待机、工作中、等待授权、已完成。" = "状态资源：固件按 Hook 状态自动切换待机、工作中、等待授权、已完成。";
"设备当前使用出厂图" = "设备当前使用出厂图";
"设备激活套图" = "设备激活套图";
"连接并识别固件后可编辑任务状态图。" = "连接并识别固件后可编辑任务状态图。";
"键位与灯效已写入；任务图因固件协议未识别而跳过。" = "键位与灯效已写入；任务图因固件协议未识别而跳过。";
